{
  "business_info": {
    "name": "Rental Village",
    "location": "Your City, State",
    "slogan": "Your project, our tools.",
    "contact_info": "rentals@rentalvillage.com | (555) 123-4567"
  },
  "available_machines": [
    {
      "id": "545573",
      "name": "Electric Wheel Barrow",
      "category": "Earth Moving Equipment, Lawn &amp; Garden",
      "description": "&nbsp;\nThe Garden Donkey™ Electric Dumper / Wheel Barrow is a clean and silent solution for transporting materials at home, farm, indoor job sites, or sensitive places where it is essential to work without fumes or noise.  The heavy duty unit has a 1000lb capacity and has a working time of 8-10hrs on a single charge. With its hydraulic dump it take all the work out of unloading. Renting a Garden Donkey is a cost-effective way to take on landscaping, construction, or gardening projects without the need to purchase expensive equipment. Enjoy faster project completion, less physical fatigue, and the satisfaction of getting the job done smarter — not harder.\n<strong>***Not to be used for Concrete - $500.00 cleaning fee WILL apply.***</strong>\n<hr />\nWould you like a slightly more casual or contractor-targeted version too? 💬🔧",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2025/04/Garden-Donkey.png",
        "https://rentalvillage.ca/wp-content/uploads/2025/04/Control-Panel-scaled.jpg",
        "https://rentalvillage.ca/wp-content/uploads/2025/04/GD-Down-scaled.jpg"
      ],
      "price": "110",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": [
        "dirt mover",
        "Garden Donkey",
        "landscape wheelbarrow",
        "power wheel barrow",
        "wheel barrow"
      ]
    },
    {
      "id": "545604",
      "name": "Track Drive Flail Mower",
      "category": "Lawn &amp; Garden, Lawn Care",
      "description": "<p class=\"\" data-start=\"141\" data-end=\"873\">Tackle tough mowing jobs with ease by renting an <strong data-start=\"190\" data-end=\"210\">Orec flail mower</strong>. Built for power and durability, the Orec flail mower features a heavy-duty engine, adjustable cutting heights, and robust flail blades that effortlessly chop thick brush, tall grass, and even saplings. Its compact design and easy maneuverability allow you to navigate tight spaces and uneven terrain with confidence. Renting this professional-grade machine saves you time and energy on demanding land-clearing projects without the high cost of ownership. Whether you're maintaining trails, clearing overgrown fields, or reclaiming neglected properties, the Orec flail mower delivers exceptional performance, making your work faster, cleaner, and more efficient.",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2025/04/Orec-HRC673-Flail-Bull-Mower-Honda-GX270-Engine.jpg",
        "https://rentalvillage.ca/wp-content/uploads/2025/04/2020-Web-Cyclone-track-walk-behind-flail-mower-action-10.jpg",
        "https://rentalvillage.ca/wp-content/uploads/2025/04/2024-Cyclone-Track-Wheel-WEB-RES-Beauty-8-scaled.jpg",
        "https://rentalvillage.ca/wp-content/uploads/2025/04/Cyclone-Blade.jpg"
      ],
      "price": "90",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": [
        "Brush Cutter",
        "Bush Hog",
        "Hay mower",
        "Rough terrain mover"
      ]
    },
    {
      "id": "545621",
      "name": "Lawn Aerator | Stinger Stand on",
      "category": "Lawn Care",
      "description": "Boost your turf care results by renting the <strong data-start=\"184\" data-end=\"223\">Stinger Quad AER 3000 with Seed Box</strong>. Designed for serious productivity, this stand-on aerator delivers unmatched speed and precision, covering up to two acres per hour with its powerful core aeration system. The added seed box attachment lets you aerate and overseed in a single efficient pass, saving time and maximizing results. With hydrostatic drive, independent wheel control, and easy maneuverability, the Quad AER 3000 handles hills, tight spaces, and open fields with ease. Renting this machine gives contractors, landscapers, and property managers professional-grade performance without the heavy upfront investment. Whether for residential lawns, sports fields, or commercial properties, the Stinger Quad AER 3000 helps your customers get greener, healthier turf — faster and easier.",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2025/04/Stinger.png"
      ],
      "price": "195",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": [
        "Aerator",
        "lawn aerator",
        "ride on aerator",
        "stand on aerator",
        "Stinger aerator"
      ]
    },
    {
      "id": "545106",
      "name": "Ladder Aluminum | Step 12'",
      "category": "Ladders, Lift-Scaffold-Fence",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">12′ aluminum commercial step ladder. Sturdy for inside use. This ladder is 14&#8242; long when folded so you require at least that height to stand up. Measure twice and save the disappointment.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Step-Ladder.png"
      ],
      "price": "32",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "544737",
      "name": "Slab Vacuum - Lifter",
      "category": "Concrete Equipment",
      "description": "",
      "short_description": "<strong>Vacuum lifter, the must-have for every large format products</strong>\nThis vacuum machine is perfect for paving stones with a maximum weight of up to 150 lbs. The unit is adaptable and can be hung on a lifting device or can be easily handled by to people. It sucks and moves interlock stones and some natural stones to a designated location, eliminating the need for the operator to bend over or work on his knees. The unit can be plugged into a 120V 15amp curcuit or a small generator.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2024/05/Mickey-255.webp"
      ],
      "price": "120",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "544599",
      "name": "Construction Fence-each panel 6'x8'",
      "category": "Construction Fence, Lift-Scaffold-Fence",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Make your worksite safe by renting construction fence, each panel is 6&#8217;high and 8&#8242; long and includes one foot per end(except the first) Panels lock together at top and sit on the foot. Call us for a quote and availability.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2024/04/construction-fence.jpg",
        "https://rentalvillage.ca/wp-content/uploads/2024/04/construction-fence.jpg"
      ],
      "price": "9",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "544594",
      "name": "Scaffold End-5x5 each",
      "category": "Lift-Scaffold-Fence, Scaffold",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">We rent scaffold by the end in order to allow flexibility to your job needs. There is a base charge per contract so please call us for a quote.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2024/04/scaffold.jpg"
      ],
      "price": "1",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "544583",
      "name": "Roller- 1 Ton Double Drum",
      "category": "Compaction Equipment",
      "description": "The Wacker RD12 Roller is a compact yet powerful vibratory roller designed for efficient compaction of soil, gravel, asphalt, and other materials in various construction and landscaping projects. With a drum width of 35.4 inches and an operating weight of 2,765 pounds, this roller offers excellent maneuverability and compaction performance in tight spaces and on smaller job sites. Its dual drum design ensures uniform compaction throughout the surface, resulting in a smooth and stable finish. The RD12's hydrostatic drive system provides precise control over speed and direction, allowing operators to navigate obstacles with ease. Additionally, its ergonomic operator platform and intuitive controls enhance operator comfort and productivity during long work sessions. The Wacker RD12 Roller's reliable performance, compact size, and versatility make it an indispensable tool for achieving optimal compaction results in a variety of applications.",
      "short_description": "36&#8243; ride on roller for compaction help around your site. Compact your driveway after a top dress, roll your lawn, prepare your base for patios, or buildings.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2024/04/Wacker-roller.png"
      ],
      "price": "175",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "544507",
      "name": "Skidsteer Track | ASV RT50",
      "category": "Earth Moving Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center; color: #a6093d;\"><strong>*** Unit is available for customer pick-up but only at our Carleton Place Location</strong><strong>***</strong>\n<p style=\"text-align: center;\">The ASV RT50 Track Skid Steer is 60” wide. Heavy enough for those larger landscaping and back filling projects. Tracks allow it to go over fresh sand and fill without sinking. Full Cab with heating and air conditioning.\n<p style=\"text-align: center;\">These units weigh in at 5200 lbs roughly and require a tandem axle float if you are planning on picking up yourself. We also rent tilt deck float if you don’t have a trailer but have a truck with 10000 pounds towing capacity or more.\n<p style=\"text-align: center;\"><strong>PLEASE NOTE: The rental of this unit does not include a trailer and there is a $200 cleaning charge if returned dirty.</strong>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2024/03/ASV-RT50.jpg"
      ],
      "price": "325",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "543399",
      "name": "Mini - Rototiller",
      "category": "Lawn &amp; Garden, Tillers",
      "description": "",
      "short_description": "This 10&#8243; wide, lightweight but powerful tiller is ideal for tilling raised beds, small gardens, or tilling between rows.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2023/04/MM-56-Yardboss.jpg"
      ],
      "price": "27",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "543393",
      "name": "Bristle Broom | STIHL KB-MM Bristle Brush",
      "category": "Lawn &amp; Garden, Trimmer and KM units",
      "description": "",
      "short_description": "<div>\n<div style=\"text-align: center;\">The bristle brush attachment for the STIHL YARD BOSS yard care system is designed for sweeping with authority. It features durable nylon bristles and a wide sweeping surface, allowing for efficient clearing of leaves on walkways and driveways, as well as fluffing artificial turf. We rent this attachment on the MM Wheel Kit accessory for ultimate convenience and maneuverability. With the ability to cover an area up to 24 inches wide in a single pass, it makes quick work of sweeping jobs on paved surfaces. This attachment is known for its high quality and effectiveness in handling big cleanup jobs.</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2023/04/stihl-power-broom-800x800-1.jpg"
      ],
      "price": "48",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "543306",
      "name": "Cormidi Auger Attachment",
      "category": "Earth Moving Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center; color: #a6093d;\"><strong>***Rate is Per Day***</strong>\n<p style=\"text-align: center;\"><strong>Includes 9&#8243; Auger Bit in rental price!</strong>\nThis auger fits on our Track mini loader and not any of our skid steers.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2023/03/PostHoleAuger.jpg"
      ],
      "price": "50",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "543260",
      "name": "Toilet Auger 3'",
      "category": "Drain Cleaners",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2023/02/Toiler-Auger.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "543252",
      "name": "Fine Dust Extractor",
      "category": "Concrete Equipment",
      "description": "",
      "short_description": "Fine dust extractor for use with concrete floor grinders.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2023/02/FineDustVacuum.jpg"
      ],
      "price": "120",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "542920",
      "name": "Cormidi Track Loader",
      "category": "Earth Moving Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center; color: #a6093d;\"><strong>*** This unit is only available for pick-up and return from/to our Carleton Place Location***</strong>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/10/Track-Loader-1.jpg"
      ],
      "price": "150",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "542910",
      "name": "Stump Grinder | Bandit SG-40",
      "category": "Lawn &amp; Garden, Stump Grinder",
      "description": "",
      "short_description": "<div>\n<div style=\"text-align: center;\">The Bandit SG-40 stump grinder is a compact and powerful machine designed to efficiently grind stumps in tight, restricted areas. It is equipped with a 38hp Kohler EFI engine, making it capable of plowing through nearly any stump. The rubber track undercarriage is gentle on delicate lawns yet strong enough to navigate rough terrain. The machine offers enhanced operator visibility and maneuverability, with two cutter wheel options available. Additionally, the controls are ergonomically designed for ease of use. With its state-of-the-art manufacturing, the Bandit SG-40 is a versatile and reliable solution for stump grinding professionals.</div>\n</div>\n<p style=\"text-align: center; color: #a6093d;\">\n*** This unit is only available for pick-up and return from/to our Carleton Place Location***",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/10/Bandit-Stump-Grinder-e1665157022630.png"
      ],
      "price": "325",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "542147",
      "name": "Single Axle | Trailer Float",
      "category": "Trailers",
      "description": "",
      "short_description": "Tilt deck trailer, deck size is 14&#8217;x 74&#8243; with a 2&#8243; ball and has an on deck capacity of 5000 lbs if attached to a appropriate tow vehicle. Perfect for small tractors, excavators, scissor lifts, and even side by side.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/FT-6-T-GW.89391EDS.jpg"
      ],
      "price": "52",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "542052",
      "name": "Power Head | STIHL KM 91R",
      "category": "Lawn &amp; Garden, Trimmer and KM units",
      "description": "The Stihl KM powerhead is a versatile and robust tool designed to meet the diverse needs of professional landscapers and homeowners alike. Powered by a dependable engine, it offers ample torque and smooth operation for a wide range of attachments, making it the cornerstone of Stihl's KombiSystem. Its ergonomic design, featuring a comfortable loop handle and intuitive controls, ensures user comfort and ease of use during prolonged tasks. The Stihl KM powerhead's compact size and lightweight construction enhance maneuverability and reduce fatigue, while its easy-to-start system and low-emission engine contribute to environmental friendliness and operator convenience. With its compatibility with numerous attachments, from trimmers to cultivators to hedge trimmers, the Stihl KM powerhead offers unparalleled versatility and efficiency, empowering users to tackle various landscaping tasks with confidence and precision.",
      "short_description": "<div>\n<div style=\"text-align: center;\">The STIHL KM 91 R KombiMotor is a powerful and versatile professional-grade multi-tool designed for a wide range of outdoor maintenance tasks. It features a simplified start-up sequence for convenient starting, a larger fuel tank for increased battery life, and a paper air filter. The loop handle ensures good maneuverability, even in confined spaces, while the barrier bar protects against accidents. The KombiMotor offers 30% longer run time compared to previous models and is compatible with a full line of high-quality attachments. It is designed for comfort and ease of use, with an ergonomic design that reduces operator fatigue and an anti-vibration system. If you&#8217;re a landscaping professional looking for a dependable and efficient tool to streamline your operations, the STIHL KM 91 R KombiMotor is an excellent rental.</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/KM111.jpg"
      ],
      "price": "24",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": [
        "km",
        "powerhead",
        "trimmer"
      ]
    },
    {
      "id": "542046",
      "name": "Bed Redefiner Attachment | STIHL FBD-KM",
      "category": "Lawn &amp; Garden, Trimmer and KM units",
      "description": "&nbsp;\n&nbsp;\n&nbsp;\n&nbsp;",
      "short_description": "<div>\n<div style=\"text-align: center;\">The STIHL FBD-KM Bed Redefiner is a durable and efficient KombiSystem attachment designed for maintaining mulch and flower beds. It features a clog-minimizing deflector design and a cost-effective cutting geometry blade, enabling you to complete the job up to seven times faster than manual methods. The attachment is recommended for use with the KM 130 R, but can also be used with the KM 90 R and KM 110 R. Additionally, it includes a solid drive shaft and a protective gearbox plate, making it a durable and affordable alternative to a dedicated bed redefiner. The attachment&#8217;s adjustable depth wheel provides precision control, and it is suitable for professional gardeners, homeowners, and tree experts. <a href=\"https://rentalvillage.ca/product/stihl-power-head/\">Power Head Required</a></div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Bed-Edger.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": [
        "km"
      ]
    },
    {
      "id": "542040",
      "name": "Edger Attachment | STIHL FCB-KM",
      "category": "Lawn &amp; Garden, Trimmer and KM units",
      "description": "",
      "short_description": "<div>\n<div style=\"text-align: center;\">The STIHL FC 70 Edger is a professional curved-shaft edger designed for high performance and efficiency. It is powered by a low-emission, fuel-efficient engine that offers longer run times between refueling and up to 28% fuel savings compared to previous models. The &#8220;open&#8221; guard design helps minimize clogging, allowing for more efficient cutting. Its advanced fuel-saving technology and comfortable curved-shaft design make it an ideal choice for both home and professional use.</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Edger.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": [
        "km"
      ]
    },
    {
      "id": "542034",
      "name": "Tiller Attachment | STIHL BF-KM Cultivator",
      "category": "Lawn &amp; Garden, Trimmer and KM units",
      "description": "The Stihl KM cultivator attachment is a versatile tool designed to simplify soil cultivation tasks with exceptional efficiency and precision. Engineered to attach seamlessly to Stihl's KM series powerheads(Rent a powerhead from us or use your own), this cultivator boasts robust construction and durable tines that effortlessly break up soil, aerate, and mix amendments with minimal effort. Its adjustable tine spacing allows for customization to suit different soil types and cultivation needs, while its compact design enables easy maneuverability even in tight spaces. Whether preparing garden beds, cultivating between rows, or tackling small-scale landscaping projects, the Stihl KM cultivator attachment streamlines the cultivation process, saving time and effort while delivering optimal results for gardeners and landscapers alike.<strong> NOTE: Power head required</strong>\n<a href=\"https://rentalvillage.ca/product/stihl-power-head/\">https://rentalvillage.ca/product/stihl-power-head/</a>",
      "short_description": "<div>\n<div style=\"text-align: center;\">Transform your STIHL KombiMotor into a handheld cultivator with the BF-KM mini-cultivator attachment. Part of the STIHL KombiSystem series of attachments, this lightweight cultivator is ideal for getting into tight places and mixing things up. Use it to rejuvenate flowerbeds and other planting areas. It’s also great for mixing amendments into the soil. It’s an attachment no gardener should be without.</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Cultivator.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": [
        "km"
      ]
    },
    {
      "id": "542028",
      "name": "Pole Pruner Attachment | STIHL HT-KM",
      "category": "Lawn &amp; Garden, Trimmer and KM units",
      "description": "",
      "short_description": "<div>\n<div style=\"text-align: center;\">The STIHL HT-KM pole pruner is an efficient tool for professional landscapers, municipal operations, and fruit growers. It allows for the sawing of higher branches while standing comfortably on the ground, making it perfect for tree maintenance. The KombiTool has a total length of 126 cm, enabling users to reach branches at heights up to 3 m. With a compact and lightweight design, ergonomic working is facilitated. The STIHL HT-KM pole pruner is compatible with all STIHL KombiEngines and features a quick coupling mechanism for easy connection. <a href=\"https://rentalvillage.ca/product/stihl-power-head/\"><strong>Power Head Required.</strong></a></div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Pole-Pruner.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": [
        "km"
      ]
    },
    {
      "id": "542022",
      "name": "Hedge Trimmer Attachment | Stihl HL-KM",
      "category": "Hedge, Lawn &amp; Garden",
      "description": "The Stihl KM hedge trimmer attachment offers a convenient and efficient solution for maintaining hedges and shrubs with precision and ease. Designed to be compatible with Stihl's KM series powerheads, this attachment features sharp, dual-sided cutting blades that effortlessly slice through branches and foliage, ensuring clean and uniform cuts. Its adjustable blade angle and lightweight design provide excellent maneuverability, allowing users to trim hedges at various heights and angles without strain. With its durable construction and reliable performance, the Stihl KM hedge trimmer attachment is a valuable addition to any landscaping toolkit, enabling users to achieve professional-looking results with minimal effort and maximum efficiency.<strong> NOTE: Power head required.</strong>\n<a href=\"https://rentalvillage.ca/product/stihl-power-head/\">https://rentalvillage.ca/product/stihl-power-head/</a>",
      "short_description": "<div>\n<div style=\"text-align: center;\">The STIHL HL-KM 145° adjustable hedge trimmer attachment is designed for demanding work on high hedges or for work close to the ground. Its lightweight gearbox and modern color scheme provide excellent, flexible cutting performance. With a 145° working range, it is compatible with the STIHL KombiSystem and is lighter than previous models, helping to reduce fatigue when trimming numerous and extensive hedges. The attachment features a 60cm double-sided cutting blade that is versatile and easily adjustable in increments for a better working position and compact storage. It is ideal for efficient cutting, trimming, and shaping high hedges in heavy-duty applications, making it a valuable addition to your gardening tools arsenal.</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Hedge-Trimmer.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": [
        "km"
      ]
    },
    {
      "id": "542016",
      "name": "Line Attachment | STIHL FS-KM",
      "category": "Lawn &amp; Garden, Trimmer and KM units",
      "description": "",
      "short_description": "<div>\n<div style=\"text-align: center;\">The FS-KM Line Head Trimmer KombiTool is a versatile attachment designed for mowing and trimming around obstacles. It uses the dependable AutoCut head and delivers greater maneuverability around landscape obstacles. The attachment is suitable for use with all KombiEngines, making it a perfect tool for edging up the lawn, trimming around obstacles, and general grass maintenance. The AutoCut mowing head makes refilling the line easy, and the straight shaft is strong and durable.</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Line-Trimmer.jpg"
      ],
      "price": "10",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": [
        "km"
      ]
    },
    {
      "id": "541954",
      "name": "Wood Splitter Vertical | Wallenstein WX540L",
      "category": "Lawn &amp; Garden, Woodspliiter",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">The WX540L Wallenstein Trailer Log Splitter is a powerful and versatile woodsplitter that provides dependable splitting force and fast, efficient workflow for logs up to 24&#8243; long. With a 20-ton splitting force and the Honda GX160 engine, this log splitter is capable of handling any size of job. It can split wood both horizontally and vertically, and its average cycle time is approximately 13 seconds.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/WX540L.webp"
      ],
      "price": "48",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541829",
      "name": "Chop Saw",
      "category": "Saws",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/Chop-Saw.jpg"
      ],
      "price": "23",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541824",
      "name": "Sliding Compound Mitre Saw",
      "category": "Saws",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Sliding compound miter saw to help you with that deck, fence or trim project.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/Sliding-Mitre-Saw.jpg"
      ],
      "price": "17",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541819",
      "name": "Sawzall",
      "category": "Saws",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">A great tool for rough-in’s and demolishing, that require cutting different materials. Blades available in store.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/Sawzall.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541814",
      "name": "Jigsaw",
      "category": "Hand Tools, Saws",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Ideal for smaller intricate cuts like curves and holes where fine turns in the cut are required. May not be available at all store. Call ahead to order.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/Hitachi-Jigsaw.jpg"
      ],
      "price": "12",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541802",
      "name": "Gas Cut-Off Saw | 14\" Blade",
      "category": "Concrete Equipment, Saws",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Stihl TS420 concrete cut off saw which accepts 14″ blade. These saws have water attachment point that you can hook your garden hose up to to control dust. Rent a diamond blade for cutting concrete or buy blades for your specific use. Sometimes it makes sense to buy your own diamond blade if you have many days use for the saw.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/TS-420.jpg"
      ],
      "price": "45",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541787",
      "name": "Electric Cut-Off Saw",
      "category": "Saws",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/Electric-Cut-off-Saw.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541781",
      "name": "Circular Saw",
      "category": "Saws",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Easy way to cut wood materials for home renovations. <strong>This unit takes a 7 1/4″ blades sold separately.</strong>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/Circular-Saw.jpg"
      ],
      "price": "12",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541775",
      "name": "Chainsaw Stihl 20\" Bar 59CC",
      "category": "Saws",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Quality Stihl chainsaw with 20″ bar and chain to tackle those big jobs that yours may not be up for. We service these saws every rental and send with a freshly sharpened chain. We also send the mixed fuel with the saw which takes the fuel liability off of you.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/Gas-Chainsaw-59cc.jpg"
      ],
      "price": "45",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541769",
      "name": "49cc Gas Chainsaw 16\" Bar",
      "category": "Saws",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">A medium sized professional saw meant for an experienced user to tackle medium trees and trimming jobs.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/Gas-Chainsaw-49cc.jpg"
      ],
      "price": "39",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541763",
      "name": "Electric Chainsaw  14\"",
      "category": "Saws",
      "description": "<p style=\"text-align: left;\">Perfect for people unable to start the larger gas powered saws, or for smaller projects around the home  where electricity is available.",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/Electric-Chainsaw.jpg"
      ],
      "price": "24",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541746",
      "name": "Cart For Cut-Off Saws",
      "category": "Concrete Equipment, Saws",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Use this cart to help you make straight cuts on your newly poured floor or across your driveway. Fits all Stihl TS 410-TS500i cut quick  so rent ours or use your own saw.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/Cart-For-Saw.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541740",
      "name": "Mosquito Barrier 3.79L Bottle",
      "category": "Sales Items",
      "description": "",
      "short_description": "<p style=\"text-align: center;\"><strong>Bottles can be used with the <a href=\"https://rentalvillage.ca/product/stihl-sr-450-sprayer/\">STIHL SR450 Sprayer.</a></strong>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/230025.jpg"
      ],
      "price": "166.95",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541738",
      "name": "Mosquito Barrier 1L Bottle",
      "category": "Sales Items",
      "description": "",
      "short_description": "<p style=\"text-align: center;\"><strong>Bottles can be used with the <a href=\"https://rentalvillage.ca/product/stihl-sr-450-sprayer/\">STIHL SR450 Sprayer.</a></strong>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/MB-Quart-Hi-Res.jpg"
      ],
      "price": "44.95",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541715",
      "name": "Mosquito Barrier Ready 2 Use",
      "category": "Sales Items",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/6000203630706.jpg"
      ],
      "price": "24.95",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541646",
      "name": "26' Scissor Lift",
      "category": "Lift-Scaffold-Fence, Lifts",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/04/Compact-2632E.jpg"
      ],
      "price": "180",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541639",
      "name": "Backpack Sprayer | STIHL SR 450",
      "category": "Blower/Sprayer, Lawn &amp; Garden",
      "description": "The Stihl SR450 sprayer boasts a range of features designed to make spraying tasks efficient and effortless. Equipped with a powerful 2.9 horsepower engine, it delivers consistent and precise spraying performance. Its ergonomic design, including padded shoulder straps and a comfortable backrest, ensures user comfort even during extended use. The sprayer also features a large 12-liter tank capacity, reducing the need for frequent refills, while its adjustable spray nozzle allows for customizable application based on specific needs. The benefits of the Stihl SR450 extend beyond its features, as it enables users to cover large areas quickly and effectively, whether for mosquito and tick control, weed management, or applying fertilizers. Its reliability, durability, and ease of use make it an indispensable tool for professionals and homeowners alike in maintaining lush and healthy outdoor spaces. Check out our stock on garlic based spray for mosquito and tick control.",
      "short_description": "<p style=\"text-align: center;\">The STIHL SR 450 Backpack Sprayer is a professional-grade, low-emission, and fuel-efficient sprayer that offers a 20% greater spray range compared to previous models. It is ideal for distributing liquid or solid compounds and easily converts from misting to dusting applications without the need for special tools. The sprayer provides excellent control over product feed and air speed, and is equipped with an anti-vibration system to reduce operator fatigue. Additionally, it features an adjustable support harness for even weight distribution, reducing user fatigue.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/sr450.jpg"
      ],
      "price": "48",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541513",
      "name": "2\" Semi-Trash Pump",
      "category": "Pumps: Gas &amp; Electric",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/image001-1.jpg"
      ],
      "price": "33",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541189",
      "name": "Fine Dust Vacuum | 12 Gallon",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">High capacity fine dust vacuum. A must for drywall dust or concrete grinding equipment. Filter bags not included.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Fine-Dust-Vac.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541177",
      "name": "Drywall Shop-Vac",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Large, quiet vacuum for dry only pick up. Filter bags sold serarately.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Drywall-Shop-Vac.jpg"
      ],
      "price": "36",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541171",
      "name": "Tile/Linoleum Roller",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Weighs a total of 100 lbs for superior flooring adhesion.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/image012-1.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541165",
      "name": "Laminate Floor Cutter",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Guillotine style cutter, cuts up to 8 1/4″ approx.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/image009-1.jpg"
      ],
      "price": "25",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541159",
      "name": "Knee Kicker",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">For stretching carpet, unit has adjustable pile depth and extends an extra 6″ for ease of use.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/image007-1.jpg"
      ],
      "price": "16",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541153",
      "name": "Heat Bond Iron",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/image006-1.jpg"
      ],
      "price": "21",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541147",
      "name": "Floor Stripper | Hand Electric",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">This electric unit relieves fatigue from a manual floor stripper and gets the job done. Blade sold separately.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/image002-1.jpg"
      ],
      "price": "45",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541141",
      "name": "Manual Floor Stripper",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\" style=\"text-align: center;\">\nUnit is 8″ wide and is best used for linoleum and asphalt tile. Blade not included.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/image011.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541140",
      "name": "Floor Stripper | Electric",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Can remove linoleum or asphalt tile off both wood or concrete with ease. Not suitable  for ceramic removal. Blades sold separately.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Electric-Floor-Stripper-1.jpg"
      ],
      "price": "54",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541133",
      "name": "Floor Sander Square | Buff Bag",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Bagged unit helps keep the dust out of the air. Takes 12″ by 18″ sandpaper sheets and pads sold separately. Non-bagged unit also available.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Square-Buff-Bagged.jpg"
      ],
      "price": "48",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541126",
      "name": "Floor Sander | Square Buff",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Great for light sanding of decks or floors. Takes 12″ by 18″ sheets and pads sold separately. Bagged unit also available.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Square-Buff-No-Bag.jpg"
      ],
      "price": "36",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541118",
      "name": "Floor Sander | Drum",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Aggressive machine for tough sanding jobs both outside and inside. Unit sandpaper is 8″ wide.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Drum-Sander.jpg"
      ],
      "price": "42",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541112",
      "name": "Floor Polisher | 17\" 2 Speed",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Two speeds for scrubbing and polishing. Unit runs at 175 rpm or 320rpm. Takes 17″ pads sold separately.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Floor-Polisher.jpg"
      ],
      "price": "36",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541106",
      "name": "Floor Edger",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">High powered 8″ disc floor edger makes quick work of the floor edges or sub floor joints. Sandpaper discs not included.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Floor-Edger.jpg"
      ],
      "price": "25",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541100",
      "name": "Carpet Cleaner",
      "category": "Floor Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Versatile to do floors, stairs and upholstery, commercial grade unit. <a title=\"UPHOLSTERY ATTACHMENT\" href=\"https://rentalvillage.ca/product/upholstery-attachment/\">Upholstery attachment</a> does not have a powered agitating brush.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Carpet-Cleaner.jpg"
      ],
      "price": "25",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541077",
      "name": "Wallpaper Steamer",
      "category": "Wall &amp; Ceiling",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Make wall paper fall off the wall(except that vinyl stuff) with ease.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Wallpaper-Steamer.jpg"
      ],
      "price": "21",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541076",
      "name": "Texture Applicator",
      "category": "Wall &amp; Ceiling",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Texture-Applicator.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541070",
      "name": "Panel Lift | 11'8\" Max",
      "category": "Wall &amp; Ceiling",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Quality Panel Lift to get the drywall from the floor to the ceiling with ease. Tilting head and 3 pivoting castors make it easy move around and position the drywall just where you need it. Unit reaches to 11’5″ in its standard form and if you have ceilings higher than that you need to rent an extension that will get you to 16′.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Panel-Lift.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541065",
      "name": "Ozone Generator",
      "category": "Wall &amp; Ceiling",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">This professional grade Ozone Generator can be used virtually anywhere odors are a problem. In fact, hospitals around the world use large ozone generators to decontaminate operating rooms between surgeries. Here are just of a few examples of where to use OdorStop:\n<p style=\"text-align: center;\"><strong>Real Estate Sales</strong> — freshen air before open houses<br />\n<strong>Rental Properties</strong> — clean and sanitize between tenants<br />\n<strong>Automobiles</strong> — get rid of cigarette odors and stale smells in pre-owned vehicles<br />\n<strong>Boats/Yachts</strong> — refresh interior cabin air and eliminate musty smells<br />\n<strong>Office Buildings</strong> — clean and sanitize work spaces for better employee health<br />\n<strong>Janitorial Services</strong> — offer as an additional cleaning service<br />\n<strong>Fitness Facilities</strong> — remove odors overnight<br />\n<strong>Smoke Damage</strong> — remove smoke odors following a fire<br />\n<strong>Remodeling</strong> — include as part of remodeling clean-up",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Ozone-Generator.jpg"
      ],
      "price": "35",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541060",
      "name": "Fish Tape",
      "category": "Wall &amp; Ceiling",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Use to feed wires into walls and conduits. 75 ft long\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Fishtape.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541048",
      "name": "Utility Trailer",
      "category": "Trailers",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">An ideal trailer for any chore.  Perfect for moving equipment, dirt, furniture or whatever you may have.  The deck is 10′ long by 76″ wide has a 3500lb axle &amp; uses a 2″ ball.  Call your local store &amp; book yours today.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Utility-Trailer.jpg"
      ],
      "price": "33",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541042",
      "name": "Dual Axle | Trailer Float",
      "category": "Trailers",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Looking to move a piece of equipment, or maybe a load of lumber?  Consider this Tilt-Deck float. With the dual axles &amp;  9000 lbs capacity &amp; the right size tow vehicle you can get the job done! Deck Size- 16′ + 2′ DOVE TAIL – 79″ space between the fenders. Call your local store &amp; book yours today.\n<p style=\"text-align: center;\">Tows with 2 5/16″ ball which you supply or buy from us and requires  20″ ball height to tow level. These floats are MTO regulated and are annually safety checked.\n<p style=\"text-align: center;\">Save on delivery fees of our machines and rent a this to take to your site.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/FT-10-T-GW110247EDS.jpg"
      ],
      "price": "72",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541036",
      "name": "Dump Trailer | Dual Axle Gas",
      "category": "Trailers",
      "description": "",
      "short_description": "<div class=\"summary entry-summary\">\n<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Looking to clean-up your yard, strip your roof shingles, or grab some materials from your local landscape depot?  This is a great trailer for the job.  With the dual axles &amp;  6500 lbs capacity &amp; the right size tow vehicle you can get the job done!  Trailer has hydraulic surge brakes and tows with a 2 5/16″ ball which you supply or buy from us and requires a 20″ ball height to tow level and safely. Use this trailer if you have multiple dumps to due in a day as it has a gas motor to drive the lift cylinder instead of a battery pack. Look for the galvanized finish on trailer to distinguish it in our yard. Call your local store &amp; book yours today.\n</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Dump-trailer-gas.jpg"
      ],
      "price": "96",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541030",
      "name": "Dump Trailer | Single Axle",
      "category": "Trailers",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Looking or clean-up your yard, strip your roof shingles, or grab some materials from your local landscape depot?  This is a great trailer for the job.  With the 4500 lbs capacity &amp; the right size tow vehicle you can get the job done! Trailer tows with a 2 5/16″ ball which you provide or purchase  from us and ball height needs to be 20 ” to tow level and safely.  Utilizes standard 7 pin trailer plug and your truck charges the battery when you are driving if set up to do so.  Call your local store &amp; book yours today.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Dump-Trailer-Single-Axle.jpg"
      ],
      "price": "72",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541017",
      "name": "Tile Saw 10\" | Blade C/W Stand",
      "category": "Tile &amp; Brick Cutters",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Steel Frame And Cast Aluminum Components\n<p style=\"text-align: center;\">Powerful 2 Hp Motor With Thermal Overload Protection\n<p style=\"text-align: center;\">Belt Driven Blade Shaft\n<p style=\"text-align: center;\">Rubber-Matted Table\n<p style=\"text-align: center;\">Motor: 2 Hp, 115V, 60Hz, Single Phase, 3,450 Rpm With Thermal Overload Protection\n<p style=\"text-align: center;\">Cutting Capacity: Depth Of Cut: Max. 3-1/4″. Rip Cut: 24″ X 24″ Tile. Angle Cut: 18″ X 18″ Tile\n<p style=\"text-align: center;\">Blade Capacity: 7″ To 10″ With 5/8″ Arbor Blade\n<p style=\"text-align: center;\">Weight: 73 lbs",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/10in-tile-saw.jpg"
      ],
      "price": "42",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541012",
      "name": "24\" Score and Break | Tile Cutter",
      "category": "Tile &amp; Brick Cutters",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">24 ” score and break tile cutter which works well on general cutting of tiles. Intricate cuts or trims are better suited for the tile saws.\n<p style=\"text-align: center;\"><strong>Cutting length &#8211;</strong> 66 cm\n<p style=\"text-align: center;\"><strong>Diagonal cutting length &#8211;</strong> 46&#215;46 cm\n<p style=\"text-align: center;\"><strong>Cutting height &#8211;</strong> 6-15 mm\n<p style=\"text-align: center;\"><strong>Separator power &#8211;</strong> 800 kg\n<p style=\"text-align: center;\">\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Tile-Cutter.jpg"
      ],
      "price": "16",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "541005",
      "name": "Table Saw | Wet | 14 Inch",
      "category": "Tile &amp; Brick Cutters",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">14″ masonry/brick saw. 8 x 8 x 16″ cutting capacity. Heavy duty 3HP motor. Lightweight (only 75 lbs.) can be carried by one person\n<p style=\"text-align: center;\">Belt driven.\n<p style=\"text-align: center;\">Motor air filter that is easily maintained and protects motor.\n<p style=\"text-align: center;\">Spring-loaded cutting head for chop saw action.\n<p style=\"text-align: center;\">Sturdy handles for ease of chop saw action.\n<p style=\"text-align: center;\">Metal table rollers for strength and durability.\n<p style=\"text-align: center;\">120 Volt 15 Amp",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/14inch-Brick-Saw.jpg"
      ],
      "price": "54",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540999",
      "name": "Floor Tile | Cutter",
      "category": "Floor Equipment, Tile &amp; Brick Cutters",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Tile cutter designed to cut VCT floor tiles, roller wheels on it for easy moving while you are tiling.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Floor-Cutter.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540992",
      "name": "Diamond Saw 8\" | Table top",
      "category": "Tile &amp; Brick Cutters",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">8″ tile saw for the home owner or professional\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Table-Saw.jpg"
      ],
      "price": "27",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540980",
      "name": "Metal Detector | All Metals",
      "category": "Measuring Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">A very sensitive searching tool that can find precious metals and the like with a water proof head.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Metal-Detector-all.jpg"
      ],
      "price": "24",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540974",
      "name": "Metal Detector/Pin Finder",
      "category": "Measuring Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">For use on ferrous metals, this unit is the ideal tool for find property stakes, well caps and the like.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Metal-Detector.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540968",
      "name": "Sight Level / Builders Level",
      "category": "Measuring Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Sight glass level for building and creating slopes etc.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Builders-Level.jpg"
      ],
      "price": "25",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540962",
      "name": "Laser Level Kit | C/W Rod",
      "category": "Measuring Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Multiple uses for many projects, create a level or sloped surface that is accurate to the fraction of an inch. Pools, patios, pads, driveways and walkways are all possible with this laser level.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Laser-Level.jpg"
      ],
      "price": "42",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540956",
      "name": "Vacuum Cups",
      "category": "Moving Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Great for moving extra large pieces of glass and large tiles. *Note: Not for climbing glass skyscrapers*\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Vacuum-Cups.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540950",
      "name": "4 Wheeled | Utility Cart",
      "category": "Moving Equipment",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Utility-Cart-4-Wheel.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540944",
      "name": "Piano Cart 1000Lbs",
      "category": "Moving Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">These piano carts make moving a piano a little simpler, slide it under the piano, strap it in, and lift with the attached handles.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Piano-Cart.jpg"
      ],
      "price": "18",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540936",
      "name": "Moving Blanket",
      "category": "Moving Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Padded moving blanket to help you with those precious cargo’s.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Moving-Blanket.jpg"
      ],
      "price": "5",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540930",
      "name": "Appliance Cart | 800Lb Capacity",
      "category": "Moving Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Also known as a fridge card, these are super handy for moving appliances like fridges, stoves, washers, dryers and all the above over hard surfaces and up stairs.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Appliance-Cart.jpg"
      ],
      "price": "18",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540904",
      "name": "2-Way Wood Splitter | Split-Fire 3255",
      "category": "Lawn &amp; Garden, Woodspliiter",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\" style=\"text-align: center;\">\nA great way to get your wood pile ready!  This machine is very productive as it is a 2-way machine.  Get your wood split in half the time.  With it’s 2″ ball hitch &amp; tail lights it is easy to tow to your wood yard or get to your pile.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/2-way-wood-splitter.jpg"
      ],
      "price": "60",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540897",
      "name": "Electric Heater | 10000W 240V",
      "category": "Heating, Heating, Ventilation &amp; Lighting",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">10,000 watt electric heater that is large enough to keep your house from freezing in the winter. It has a 15′ cord with a plug that should fit into your electric stove outlet and needs a 50 amp breaker.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/10000W-Heater.jpg"
      ],
      "price": "40",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540892",
      "name": "Propane Infrared | Heater",
      "category": "Heating, Heating, Ventilation &amp; Lighting",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">90,000 BTU propane heater for the job site. Unit requires 2-3 100 lbs cylinders manifolded together, depending on outside temperature, in order to prevent freeze up of propane. Best success is to arrange for a 420 lbs cylinder if you will be needing for an extended time.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Radiant-Heater.jpg"
      ],
      "price": "40",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540886",
      "name": "Natural Gas | Infrared Heater",
      "category": "Heating, Heating, Ventilation &amp; Lighting",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Natural gas fired radiant construction heater developing 90,000 BTU. thermostat and safety tip switch built in. 50′ of supply line included.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Radiant-Heater.jpg"
      ],
      "price": "40",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540871",
      "name": "Kerosene Heater | Radiant",
      "category": "Heating, Heating, Ventilation &amp; Lighting",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Kerosene or #1 Diesel fired radiant heater with thermostatic control. These heaters require a good extension cord and a clean 15 amp circuit to keep them working well. They also require ventilation and can’t be used in an occupied(lived in space)\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Radiant-Kerosene-Heater.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540866",
      "name": "Propane Heater | 30000 BTU Infrared",
      "category": "Heating, Heating, Ventilation &amp; Lighting",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Heater-Propane-30000-BTU.jpg"
      ],
      "price": "25",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540861",
      "name": "Kerosene Heater | 70000 BTU",
      "category": "Heating, Heating, Ventilation &amp; Lighting",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\" style=\"text-align: center;\">\nKerosene or #1 Diesel fired heater with thermostatic control. These heaters require a good extension cord and a clean 15 amp circuit to keep them working well. They also require ventilation and can’t be used in an occupied(lived in space.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Duraheat-700000BTU.jpg"
      ],
      "price": "25",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540850",
      "name": "Electric Heater | 6000W 240V",
      "category": "Heating, Heating, Ventilation &amp; Lighting",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\" style=\"text-align: center;\">\n600 watt electric heater that works on 240V and the cord end should fit into your dryer plug. The unit needs a 30AMP breaker.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Electric-Heater-6000W.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540845",
      "name": "Electric Heater | 1500W 120V",
      "category": "Heating, Heating, Ventilation &amp; Lighting",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">120 V electric heater, commercial style with thermostat. Will manage a 150 sq ft and runs on a normal household plug in.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Electric-Heater-1500W.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540840",
      "name": "Heater 85000 BTU | Ducted Direct",
      "category": "Heating, Heating, Ventilation &amp; Lighting",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">85000 BTU heater with duct. This unit is direct fired meaning the exhaust fumes exit the tube with hot air. This means that you can’t run in an occupied space and does require ventilation. depending on the temperature outside you will need to run 2-3 100 lbs cylinders manifolded together to maximize propane use.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Ducted-Heater.jpg"
      ],
      "price": "45",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540826",
      "name": "Heater 200000 BTU | Ducted Indirect",
      "category": "Heating, Heating, Ventilation &amp; Lighting",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">This 200000 BTU heater is just like your home oil or gas burning furnace with a chimney.  It provides 100% clean dry air which eliminates the chance of carbon monoxide being pumped into your work space.  It runs on #1 or #2 diesel or kerosene &amp; burns approximately 1.30 gallons per hour.  With its large 42 gallon fuel tank it will run for 30 hours +/- between fills.  It comes complete with (1) thermostat &amp; (1) 12″ x 25″ duct.  Additional 25′ ducts are available if more length is required.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/heater-1.jpg"
      ],
      "price": "150",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540821",
      "name": "Hepa 500 | Air Scrubber",
      "category": "Heating, Ventilation &amp; Lighting, Ventilation",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Rugged-built, high-efficiency air filtration. Restore and maintain indoor air quality during cleaning, remodels and remediation. Suitable for use in homes, light industrial settings, schools, hospitality venues and healthcare environments – wherever portable, efficient HEPA filtration is needed. Primary and secondary filters extra at roughly $28. HEPA FILTER INCLUDED. Carbon filter available to remove smells at extra cost.\n<div class=\"product-tabs-title\" style=\"text-align: center;\">Specs</div>\n<p style=\"text-align: center;\"><span class=\"tab-item-bold\">Air movement: </span> 250–500 CFM\n<p style=\"text-align: center;\"><span class=\"tab-item-bold\">Circuit maximum: </span> Plug up to four units together for a total of 2000 CFM on a single 15-amp circuit\n<p style=\"text-align: center;\"><span class=\"tab-item-bold\">Static pressure: </span> 2.9 in. (H2O)\n<p style=\"text-align: center;\"><span class=\"tab-item-bold\">Use weight: </span> 44 lbs. | 19.9 kg\n<p style=\"text-align: center;\"><span class=\"tab-item-bold\">Dimensions (W × H × D): </span> 26.2 × 24.6 × 18.2 in. ¦ 66.5 × 62.5 × 46.2 cm\n<p style=\"text-align: center;\"><span class=\"tab-item-bold\">Duct sizes: </span> Intake: 12 in. / Outlet: 8 in.\n<p style=\"text-align: center;\"><span class=\"tab-item-bold\">Volts: </span> 115V\n<p style=\"text-align: center;\"><span class=\"tab-item-bold\">Frequency: </span> 60 Hz\n<p style=\"text-align: center;\"><span class=\"tab-item-bold\">Amps: </span> 3A\n<p style=\"text-align: center;\"><span class=\"tab-item-bold\">Housing: </span> Rotomolded polyethylene\n<p style=\"text-align: center;\"><span class=\"tab-item-bold\">Power cord length: </span> 25 ft. | 7.62 m\n<p style=\"text-align: center;\"><span class=\"tab-item-bold\">Power outlet: </span> GFCI protected\n<p style=\"text-align: center;\"><span class=\"tab-item-bold\">Pre-filter: </span> Standard paper pre-filters, plus activated carbon (F397) and DOP (F415) filter options\n<p style=\"text-align: center;\"><span class=\"tab-item-bold\">Primary filter: </span> HEPA filtration technology",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Dri-Eaz-Defendair-Hepa-500-Air-Scrubber.jpg"
      ],
      "price": "70",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540816",
      "name": "Floor Fan | Carpet Drier",
      "category": "Heating, Ventilation &amp; Lighting, Ventilation",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">These fans are specially designed to dry floors and carpets with 2000+ CFM of air flushing out right on the floor. You  can even pull up a corner of your carpet and tuck the fan under to get the air where it needs to be. Prevent mold by drying quickly and pair it up with a dehumidifier to take the moisture from the air.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/3-speed-air-mover-fan.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540809",
      "name": "Pedestal Fan | 24\" 5000CFM",
      "category": "Heating, Ventilation &amp; Lighting, Ventilation",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">24″ 2 -speed fan on a solid base. Great for air circulation in a auditorium or a new house when dry walling.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Fan-Pedestal-1.jpg"
      ],
      "price": "17",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540804",
      "name": "Dehumidifier | 14Gal/Day",
      "category": "Heating, Ventilation &amp; Lighting, Ventilation",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Compact, state-of-the-art technology. Stackable and easy to transport, the Revolution’s space-saving design lets you bring high performance drying power to every task. Its i-Series smart controller delivers maximum performance in all conditions. Rugged rotomolded housing and durable construction ensure long life.\n<div class=\"specs-item\" style=\"text-align: center;\"><span class=\"specs-title\">WATER REMOVAL<span id=\"Content_Body_Content_rep_Product_Specs_Featured_span_specs_0\">:</span> </span><span class=\"specs-value\">80 pts./day | 38 L/day at 80°F/60%RH (AHAM)<br />\n139 pts./day | 66 L/day at 90°F/90%RH</span></div>\n<div class=\"specs-item\" style=\"text-align: center;\"><span class=\"specs-title\">AIR MOVEMENT<span id=\"Content_Body_Content_rep_Product_Specs_Featured_span_specs_1\">:</span> </span><span class=\"specs-value\">121–180 CFM | 206–306 CMH</span></div>\n<div class=\"specs-item\" style=\"text-align: center;\"><span class=\"specs-title\">DIMENSIONS (W × H × D)<span id=\"Content_Body_Content_rep_Product_Specs_Featured_span_specs_2\">:</span> </span><span class=\"specs-value\">12.5 × 17.6 × 21.5 in. | 31.8 × 44.7 × 54.6 cm</span></div>\n<div class=\"specs-item\" style=\"text-align: center;\"><span class=\"specs-title\">WEIGHT (W/CORD &amp; HOSE)<span id=\"Content_Body_Content_rep_Product_Specs_Featured_span_specs_3\">:</span> </span><span class=\"specs-value\">65 lbs. | 29.5 kg</span></div>\n<p style=\"text-align: center;\">https://www.legendbrandsrestoration.com/Products/Revolution-LGR-Dehumidifie",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Dehumidifier.jpg"
      ],
      "price": "50",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540793",
      "name": "Air Mover | 12\" 2000CFM",
      "category": "Heating, Ventilation &amp; Lighting, Ventilation",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">This fan is used for dust or fume removal and can be combined with a flexible duct to get out through a window or door. We also rent air scrubbers that have hepa filters if you are sanding floors or finishing hardwood in your house.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Air-Mover-12-in.jpg"
      ],
      "price": "26",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540788",
      "name": "Flood Light | Double 500W",
      "category": "Heating, Ventilation &amp; Lighting, Lighting",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Double-Flood-Light.jpg"
      ],
      "price": "12",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540780",
      "name": "Flood Light | Single 1000W",
      "category": "Heating, Ventilation &amp; Lighting, Lighting",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">1000 watt metal halide light which plugs into 120v. Great for large work site.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Flood-Light-Single.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540775",
      "name": "Belt Sander",
      "category": "Hand Tools",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Great for sanding stair treads and fence panels. Variety of sandpaper grits available for purchase as well.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Hitachi-Belt-Sander.jpg"
      ],
      "price": "21",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540769",
      "name": "Crowbar | 60\"",
      "category": "Hand Tools",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">One of your essential tools for digging post holes, removing rocks or chopping at stubborn ice build up.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Crowbar-60_.jpg"
      ],
      "price": "10",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540763",
      "name": "Come Along | 1 Ton 15'",
      "category": "Hand Tools",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">A heavy duty system of pulling two objects together, typically in construction or outdoor activities.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Come-Along-1-Ton.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540752",
      "name": "Aluminum Break",
      "category": "Hand Tools",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">The standard tool for bending sheet aluminum for building flashing and other materials.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Aluminum-Brake.jpg"
      ],
      "price": "51",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": [
        "aluminum",
        "bender",
        "break"
      ]
    },
    {
      "id": "540746",
      "name": "3\" Trash Pump",
      "category": "Pumps: Gas &amp; Electric",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Gas powered pump for moving a large quantity of water in a short amount of time.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Trash-Pujmp.jpg"
      ],
      "price": "45",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540739",
      "name": "2\" Trash Pump",
      "category": "Pumps: Gas &amp; Electric",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Comes with a 20′ suction and 50′ discharge hose for moving large amounts of water. Pumps approx. 230 GPM\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Tras.jpg"
      ],
      "price": "36",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540734",
      "name": "Discharge Hose | 2\" 50'",
      "category": "Pumps: Gas &amp; Electric",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">2″ layflat discharge hose for water pumps. Clip on style ends and 50′ long.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/DH2_50.jpg"
      ],
      "price": "7",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540729",
      "name": "Discharge Hose | 3\" 50'",
      "category": "Pumps: Gas &amp; Electric",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">3″ layflat discharge hose with clip style ends and 50′ long\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/DH3_50.jpg"
      ],
      "price": "8",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540723",
      "name": "Submersible Pump | 1\" Electric",
      "category": "Pumps: Gas &amp; Electric",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">1″ Pump which will pump down to 1/4′ depth. Often referred to as a puddle pump. Discharge fitting to fit your garden hose.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Simer-Pump-Electric.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540710",
      "name": "2\" Submersible | Pump",
      "category": "Pumps: Gas &amp; Electric",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Electric pump for emergency water removal or for clearing water off of pool tarps.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/222Subermisible-pump.jpg"
      ],
      "price": "21",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540696",
      "name": "Leaf Blower/Vac | STIHL SH 56 C",
      "category": "Blower/Sprayer, Lawn &amp; Garden",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<div>\n<div style=\"text-align: center;\">\nThe Stihl BG 56 C-E handheld petrol leaf blower is designed to make garden work easier by effortlessly cleaning up leaves and debris on paths or driveways around the home. Featuring the STIHL ErgoStart system, it ensures smooth starts with a specialized stop switch and semi-automatic choke lever. With the Easy2Start system and a high-performance, low emissions engine, this blower is environmentally responsible and comfortable to use. The blower has been rated highly for its ease of use and is part of the Leaf Blowers test program at Consumer Reports.\n**Warning, once you give it a try you&#8217;ll probably want to own one**\n</div>\n</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Stihl-SH56-1.jpg"
      ],
      "price": "21",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540689",
      "name": "9HP Rear Tine Rototiller",
      "category": "Lawn &amp; Garden, Tillers",
      "description": "",
      "short_description": "Till effectively in small spaces by using this 18″ wide machine.  The unique swivel handlebar featured on this compact unit means you can walk alongside your tiller rather than in your freshly tilled earth.  Don’t let this narrow machine fool you,  with its heavy design the tiller works for you instead of tossing you around.  Counter-rotating tines break up the most difficult soil, clay, or sod.  Wheels and tines work independently of each other to allow your tilling travel speed to be adjusted to the soil conditions.  This easy to use machine comes on it own trailer for easy pick-up (2″ ball required).  Call your local store and book yours today!",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Barreto-918h.jpg",
        "https://rentalvillage.ca/wp-content/uploads/2022/03/918H-Tille.jpg",
        "https://rentalvillage.ca/wp-content/uploads/2022/03/918HTiller-Controls.jpg",
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Baretto-Tiller.jpg"
      ],
      "price": "63",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540687",
      "name": "6HP Stump Grinder | Dosko",
      "category": "Lawn &amp; Garden, Stump Grinder",
      "description": "",
      "short_description": "<div>\n<div style=\"text-align: center;\">The stump grinder featured here is powered by reliable Honda engines and is designed to be compact, portable, and easy to use. It&#8217;s equipped with Green Tooth cutting systems and offer a versatile and robust solution for grinding stumps. The unique side discharge chassis provides a clearer line of vision while grinding, and some models feature a foldable design for easy transportation and storage. With features such as cyclone air cleaners, direct belt drives, and adjustable handlebars, these stump grinders are suitable for efficiently removing stumps in various environments. If you are looking for a portable and efficient stump grinding solution, this product offer quality and ease of use.</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Dosko-6HP-1.jpg"
      ],
      "price": "60",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540679",
      "name": "Lawn Dethatcher | Ryan Turf Ren-O-Thin Power Rake",
      "category": "Dethatcher, Lawn &amp; Garden",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Over time your lawn builds up a layer of thatch which act as a barrier to water and air penetration into soil. the concept of the de-thatcher is similar to an aggressive rake with a hard back garden rake taking the layer of thatch up off the soil. Don’t be alarmed by the appearance as the lawn will fill back in as the nutrients are able to sink in. You will find this to work best if you wait until your grass has greened up after winter and can be done at any point after that providing you supply enough moisture to help it recover.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Ryan-Dethatcher.jpg"
      ],
      "price": "48",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540672",
      "name": "Lawn Roller | Kesmac KTR 30",
      "category": "Lawn &amp; Garden, Rollers",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">When you need heavy flatting force for your lawn after winter or new sod this is the tool for you. When filled with water it weighs in at 850 lbs. Even empty it is a heavy machine so you need a trailer with a ramp or a good set of ramps for your pickup.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Lawn-Roller-Gas.jpg"
      ],
      "price": "60",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540662",
      "name": "Pole Pruner Manual | Fiskars Extendable Pole Saw &amp; Pruner (7'–16')",
      "category": "Hedge, Lawn &amp; Garden",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">A safe and affordable way to trim up the trees on your property.  With the folding saw blade &amp; pruning shear it is perfect for any size job.  Leave your ladder in the shed, this unit extends up to 14′ and will manage branches up to 2″.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Pole-Pruner-Manual.jpg"
      ],
      "price": "16",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540641",
      "name": "Electric Chainsaw | STIHL MSE 141",
      "category": "Lawn &amp; Garden, Saws",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<div>\n<div style=\"text-align: center;\">The MSE 141 C-Q electric chainsaw is a lightweight and affordable option, making it ideal for homeowners and carpenters. With a powerhead just over six pounds, it is the lightest electric chainsaw in its class, suitable for a variety of outdoor and indoor tasks such as firewood cutting, storm cleanup, and woodworking. The saw is packed with premium features including a coast-down brake, low-kickback chain, and an extension cord retainer. Additionally, it offers good ergonomics for effortless work, side-mounted chain tensioning, Quickstop Super chain brake, and overload protection. If you&#8217;re looking for a reliable and maneuverable electric chainsaw with good cutting performance, the MSE 141 C-Q is a great choice.</div>\n</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/MSE-141.jpg"
      ],
      "price": "24",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540633",
      "name": "Turf Revitalizer | Classen HTS-20H PRO Hydro-Drive",
      "category": "Lawn &amp; Garden, Seeder",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Classen-Overseeder-1.jpg"
      ],
      "price": "60",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540626",
      "name": "Towable Sprayer 25 Gallon | Chapin 97700E",
      "category": "Lawn &amp; Garden",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">A tow-behind lawn sprayer offers a convenient and efficient solution for large-scale lawn care and maintenance tasks. Featuring a sturdy frame and durable materials, it can be easily attached to a variety of vehicles, including lawn tractors and ATVs. The sprayer typically comes equipped with a high-capacity tank, allowing for extended spraying sessions without the need for frequent refills. Adjustable spray nozzles enable users to customize application patterns and coverage, ensuring even distribution of fertilizers, herbicides, or pesticides across the lawn. Additionally, many tow-behind sprayers feature a boom or wand attachment, providing versatility in reaching tight corners or specific areas. The benefits of a tow-behind lawn sprayer include time and labor savings, as well as the ability to efficiently maintain large lawns or fields with minimal effort, resulting in healthier, more vibrant vegetation.\n<p style=\"text-align: center;\">Rental rates do not include cleaning so please flush when finished.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Sprayer-Towable.jpg"
      ],
      "price": "36",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540619",
      "name": "Towable Spreader 130lb | Agri-Fab 45-0463",
      "category": "Lawn &amp; Garden, Seed/Fertilizer Spreader",
      "description": "",
      "short_description": "<div>\n<div style=\"text-align: center;\">The Agri-Fab 130 lb. Tow Broadcast Spreader is designed to be towed by a lawn tractor, offering a capacity of up to 130 lb. for spreading ice melt, fertilizer, and seed with a 12 ft. spread width. It features a commercial-grade gearbox, easy-set controls, and pneumatic tires for maneuverability. The enclosed gearbox prevents disruption during spreading. With a durable rod-linked on-off control, precise settings, and large diameter tires for stability on rough terrain, this spreader is suitable for larger acreage lawns. Additionally, it can be towed behind ride-on mowers, quads, or ATVs, making it versatile for various outdoor maintenance tasks. If you&#8217;re looking for a reliable and versatile tow broadcast spreader, the Agri-Fab 130 lb. Tow Broadcast Spreader is a great choice.</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/130lb-tow-spreader.jpg"
      ],
      "price": "24",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540612",
      "name": "Lawn Roller Push | Agri-Fab 45-0267",
      "category": "Lawn &amp; Garden, Rollers",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Fill with water and roll on- weights around 250 when full and is very light for transport when empty.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Push-Roller.jpg"
      ],
      "price": "12",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540605",
      "name": "Lawn Roller Towable | Agri-Fab 45-0269",
      "category": "Lawn &amp; Garden, Rollers",
      "description": "<div>\n<div style=\"text-align: center;\">The Agri-Fab Push/Tow Lawn and Garden Roller is a versatile and efficient tool for maintaining a smooth and even lawn. It can be hand-pushed or towed behind a ride-on mower, making it suitable for various lawn sizes. With a lightweight design, weighing just 40 lbs when empty and 250 lbs when full, it is easy to transport and store. The roller features a corrosion-resistant poly drum with smoothly-moulded edges to prevent turf damage during use. Whether you need to tackle uneven ground, pack down newly sown seed, or flatten sod after frost or pest damage, the Agri-Fab roller is designed to make the job quick and easy</div>\n</div>",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Towable-Lawn-Roller.jpg"
      ],
      "price": "21",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540596",
      "name": "Lawn Mowers | Honda HRS216PKA",
      "category": "Lawn &amp; Garden, Lawn Care",
      "description": "<div>\n<div style=\"text-align: center;\">The Honda  Walk-Behind   push Lawn Mower is a powerful and reliable choice for maintaining your lawn. With a 21-inch cutting width and a powerful Honda GCV170 engine, this mower offers outstanding performance and maneuverability, especially on tough terrain. The mower's large back wheels make it easy to navigate around hills and uneven ground, while the NeXite deck material ensures durability and resistance to dents, rust, and corrosion over time.</div>\n</div>",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Honda 21″ lawnmower works just as you expect a Honda would. Adjustable wheel to get you set at the height you want your grass to be.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Honda-Lawnmower.jpg"
      ],
      "price": "24",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540589",
      "name": "Fertilizer Spreader Push | Agri-Fab 45-0388",
      "category": "Lawn &amp; Garden, Seed/Fertilizer Spreader",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">The Agri-Fab Push Broadcast Spreader is a versatile tool suitable for spreading fertilizer, seed, or ice melt. With a durable plastic hopper and closure plate, this spreader resists corrosion for long-lasting use. The positive flow adjustment design ensures accurate spread patterns up to 10 ft. wide. The 85 lb. capacity allows for less time spent refilling the spreader, and it covers up to 14,000 square feet, making it ideal for expansive lawn maintenance. The ergonomic handle design and large tires make lawn care easy, while the fully enclosed gearbox protects the gears. This spreader is designed for precise application and even distribution of materials. If you&#8217;re looking for a reliable spreader to maintain a lush lawn, the Agri-Fab Push Broadcast Spreader is a great choice.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Fertilizer-Spreader.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540581",
      "name": "Power Broom Attachment | STIHL KW-KM PowerSweep™",
      "category": "Lawn &amp; Garden, Trimmer and KM units",
      "description": "The Stihl KM power sweep attachment is a versatile tool designed to simplify debris and snow removal tasks with exceptional efficiency and precision. Engineered to attach seamlessly to Stihl's KM series powerheads, this attachment features a durable rubber paddle that effectively sweeps debris, leaves, and light snow from paths, driveways, gravel from grass and other surfaces. Its adjustable height and angle allow for customizable sweeping, ensuring thorough cleaning in various conditions. The Stihl KM power sweep attachment's compact design and lightweight construction enhance maneuverability, making it easy to navigate tight spaces and corners. With its reliable performance and easy-to-use design, the Stihl KM power sweep attachment streamlines cleanup tasks, saving time and effort while maintaining pristine outdoor spaces year-round. <strong>NOTE: Power head required.</strong>\n<a href=\"https://rentalvillage.ca/product/stihl-power-head/\">https://rentalvillage.ca/product/stihl-power-head/</a>",
      "short_description": "<p style=\"text-align: center;\">Looking for a quick &amp; easy way to clean-up your yard this spring?  This is the tool for the job!  The power broom is the perfect tool to clean-up after the snow plows or blowers.  It will clean-up your driveway as well as remove stones from your lawn.  The ideal time to use this unit is when your lawn/yard has dried up &amp; just when you start to see signs of the grass starting to grow.  This is the attachment that fits the Stihl KM series units, rent one or use your own motor.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Power-Broom.jpg"
      ],
      "price": "35",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": [
        "km"
      ]
    },
    {
      "id": "540568",
      "name": "Leaf Blower Backpack | STIHL BR 600",
      "category": "Blower/Sprayer, Lawn &amp; Garden",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<div>\n<div style=\"text-align: center;\">The STIHL BR 600 Backpack Blower is a powerful and fuel-efficient outdoor cleanup tool, ideal for professionals and homeowners. It features an adjustable support harness that minimizes user fatigue and offers an impressive power-to-weight ratio. The 4-MIX engine provides increased durability, longer life, and low emissions. Additionally, the blower comes with a specially designed nylon harness for high wear resistance. With its unmatched power, ergonomic design, and environmental responsibility, it&#8217;s the top choice for demanding outdoor cleanup tasks. The blower is equipped with an innovative 4-MIX engine for a more pleasant sound, low fuel consumption, and low emissions.</div>\n</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/BR600-1.jpg"
      ],
      "price": "36",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540561",
      "name": "Lawn Vacuum | Little Wonder HPV 5612-00-01",
      "category": "Lawn &amp; Garden",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">For your yard or garbage clean up use this tool to vac and bag. Fast and efficient.\n<p style=\"text-align: center;\">DUE TO HIGH DEMAND WE ARE NOT ABLE TO OFFER SPECIAL WEEKLY OR MONTHLY RATES.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Little-Wonder-HPV.jpg"
      ],
      "price": "45",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540549",
      "name": "Brush Chipper 6\" Hydraulic Infeed | Bandit 65XP",
      "category": "Lawn &amp; Garden, Wood Chipper",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Brush Chipper with 6″ diameter capacity and hydraulic in feed- ideal for large jobs or commercial applications. Unit must be towed with at least a full size pick-up or SUV as tongue weight is close to 200 lbs. This also means it is too heavy to move around your property by hand or by a quad. There are times when these machines are busy so call ahead and reserve in order to get you job done.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Chipper-6-Inch.jpg"
      ],
      "price": "165",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540543",
      "name": "Brush Chipper 4\" Manual Infeed | Salsco",
      "category": "Lawn &amp; Garden, Wood Chipper",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">4″ diameter wood capacity with a funnel style manual in-feed chute. Will handle hard wood and soft wood with ease, large funnel style chute to accept those crutches in the limbs. Tows with a 2″ ball and has a well balanced tongue weight to make it easy to move around your property. We take care to ensure the knives are sharp for each rental and appreciate your effort to keep the stones and sand out. By doing so you will also find your job goes faster.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Brush-Chipper.jpg"
      ],
      "price": "90",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540537",
      "name": "Chain Link Fence Stretcher | SpeeCo Woven Wire Stretcher",
      "category": "Auger and Fencing, Lawn &amp; Garden",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<div>\n<div style=\"text-align: center;\">If you&#8217;re in need of a fence stretcher, we have a selection of high-quality products to help you get the job done. Whether you&#8217;re working with chain link, woven wire, or welded wire fencing, these tools are designed to efficiently stretch and maintain proper tension in your fence. Some options come with hooks for easy attachment and even stretching. With heavy-duty capabilities and the ability to handle long lengths of fence wire, these stretchers are essential for any fencing project.</div>\n</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Fence-Stretcher.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540531",
      "name": "Rough Terrain Mower | Little Wonder BRC-26",
      "category": "Lawn &amp; Garden",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<div>\n<div style=\"text-align: center;\">The Little Wonder Hydro Brush Cutter is a commercial-grade machine designed for clearing underbrush, cutting down forest brush, establishing trails, and maintaining roadside verges. It features a 30&#8243; wide, 10-gauge welded steel deck, a 26&#8243; reversible blade, and adjustable plate steel skid shoes for excellent floatation over rough terrain. The brush cutter is powered by a durable Honda engine and offers infinitely variable, clutchless speed selection. With solid rod linkage to the transmission and cutter blade clutch, worry-free cutting is ensured. The rugged design and top-of-the-line features make the Little Wonder Hydro Brush Cutter a clear-cut winner for demanding landscaping tasks.</div>\n</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Rough-Terrain-Mower.jpg"
      ],
      "price": "75",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540524",
      "name": "5HP Rototiller",
      "category": "Lawn &amp; Garden, Tillers",
      "description": "",
      "short_description": "The 5hp Tiller is the main workhorse in our offering.  With its adjustable depth and flip up transport wheels it&#8217;s ready to dig into toughest jobs.  At 26 inches wide and with a tilling depth of 10 inches it&#8217;s perfect for working up larger existing gardens and mixing in compost.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Maxim-Rototiller.jpeg",
        "https://rentalvillage.ca/wp-content/uploads/2022/03/F501.jpg",
        "https://rentalvillage.ca/wp-content/uploads/2022/03/RMT-55-scaled.webp",
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Honda-F501.jpg"
      ],
      "price": "47",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540517",
      "name": "2HP Rototiller",
      "category": "Lawn &amp; Garden, Tillers",
      "description": "",
      "short_description": "Small but mighty!  The Honda F220 Tiller is the perfect size for existing gardens or working up loose soil.  At 20 inches wide and a tilling depth of 8-10 inches its a great choice for smaller gardens",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/F220.jpg"
      ],
      "price": "39",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540509",
      "name": "Sod Cutter 18\" | Ryan Jr. Sod Cutter",
      "category": "Lawn Care",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Make your sod removal fast and easy, whether you are creating a new garden, installing an above ground pool, putting in a walkway or fixing winter kill. You will thank yourself for choosing this heavy duty 18″ sod stripper. Remember as the summer heats up and the ground gets dry and hard you will need to water prior to trying to remove sod. Will make your job so much easier.\n&nbsp;",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Sod-Cutter.jpg"
      ],
      "price": "72",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540502",
      "name": "Post Hole Auger | Man Operated",
      "category": "Auger and Fencing, Lawn &amp; Garden",
      "description": "",
      "short_description": "<div>\n<div style=\"text-align: center;\">A heavy duty, contractor quality post hole digger with a unique clam-shell &amp; lever design to accommodate working in tight locations/close to obstructions. Unique design will accommodate narrow holes up to 54″ in depth.</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Post-Hole-Auger-1.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540495",
      "name": "Post Auger Two-Man | Brave Pro BRPA265H",
      "category": "Auger and Fencing, Lawn &amp; Garden",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Whether you are fencing, decking or drilling test holes these 2 man units are strong and robust. You can do up to 12″ hole with them but remember it is up to the operator to hold tight when you hit a root or rock. We suggest 10″ bit max for these because the drilling in our area is a bit rough. If the job is big or digging is tough you might consider the 1 man hydraulic unit or the mini loader with the auger attachment.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/2-man-auger.jpg"
      ],
      "price": "54",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540484",
      "name": "Post Auger Hydralic One-Man | Brave Pro BRPA325H",
      "category": "Auger and Fencing, Lawn &amp; Garden",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<div>\n<div style=\"text-align: center;\">The BravePro Hydraulic 1-Man Towable Earth Auger is a powerful and professional-grade machine designed to make post hole digging a breeze. It features a 9 HP Honda engine, allowing for easy digging using any BravePro auger bit up to 18 inches in diameter. The use of hydraulics provides variable auger speed and reverse capabilities, while the locking mechanism on the digging head allows the auger to be held up and out of the way for easy maneuvering around the job site. With a maximum drilling torque of 275 foot-pounds, this auger is well-suited for professional landscapers, contractors, and DIY enthusiasts. If you&#8217;re looking for a high-quality, durable, and reliable earth auger, the BravePro Hydraulic 1-Man Towable Earth Auger is an excellent choice.</div>\n</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Post-Auger-1-Man.jpg"
      ],
      "price": "70",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540466",
      "name": "Wheel Wagon | For Scaffold",
      "category": "Lift-Scaffold-Fence, Scaffold",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Wagon wheels for under scaffolding with 8″ no flat tires and leveling jacks built in. Base charges apply to this item.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Wagon-Wheel.jpg"
      ],
      "price": "20",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540460",
      "name": "Scaffold Castors | 8\" Hard",
      "category": "Lift-Scaffold-Fence, Scaffold",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Casters are priced by the each and subject to base charge on invoice.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/M-MBC8-1024x1024-1.jpg"
      ],
      "price": "2",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540455",
      "name": "Scaffold | Outrigger",
      "category": "Lift-Scaffold-Fence, Scaffold",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Required when scaffolding exceeds 3 sections if not tied off.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Staffold-Stabilizers.jpg"
      ],
      "price": "4",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540450",
      "name": "Scaffold Side | Bracket",
      "category": "Lift-Scaffold-Fence, Scaffold",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: right;\">Used an extension off the side of scaffolding to put platform or planks on, often used by masons or siding installers. . Rented individually not by set.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Scaffold-Outrigger.jpg"
      ],
      "price": "4",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540445",
      "name": "Aluminum Platform | 20\" x 7'",
      "category": "Lift-Scaffold-Fence, Scaffold",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">24″ wide platform for scaffold with aluminum frame and plywood top. Safe and secure. Base charges apply to these times so call for quote.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Platform.jpg"
      ],
      "price": "3",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540440",
      "name": "Scaffold Leveling | Jack 24\"",
      "category": "Lift-Scaffold-Fence, Scaffold",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Level jacks are rented by the piece and our base charges apply to each contract.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Scaffold-Leveling.jpg"
      ],
      "price": "2",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540428",
      "name": "Guardrails",
      "category": "Lift-Scaffold-Fence, Scaffold",
      "description": "",
      "short_description": "Guard Rail Set complete with uprights and rails",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Guardrails.jpg"
      ],
      "price": "12",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540421",
      "name": "Inverter | 6000W",
      "category": "Generators &amp; Cords",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Kipor-6000-Watt.jpg"
      ],
      "price": "51",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540416",
      "name": "Inverter | 3600W",
      "category": "Generators &amp; Cords",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Slightly larger inverter for mulitple power needs including sensitive electronic equipment, weddings, parade floats and the like. Great for area’s that require low noise.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Patron-3600-Inverter.webp"
      ],
      "price": "42",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540410",
      "name": "Inverter | 2100 Watt",
      "category": "Generators &amp; Cords",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">A pure sine wave inverter for sensitive electronic equipment. Smaller jobs or noise sensitive area’s like weddings and parade floats are ideal for this easy to carry unit!\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Patron-2100W-Inverter.jpg"
      ],
      "price": "36",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540403",
      "name": "Generator 5000 | Watt Series",
      "category": "Generators &amp; Cords",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">The biggest generator we carry for demanding work sites and emergency power situations.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Kohler-5000W-Generator.avif"
      ],
      "price": "51",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540398",
      "name": "Generator 3600 | Watt Series",
      "category": "Generators &amp; Cords",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Our most rented generator for job sites and the like. Solid performance with fuel saving idle control for when power draw is low or not needed.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/BE-BE4200PS.webp"
      ],
      "price": "39",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540388",
      "name": "Extension Cord 50'",
      "category": "Generators &amp; Cords",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Heavy duty 110V cord running 10 gauge wire. Available in 50 foot lengths only.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Extension-Cord.jpg"
      ],
      "price": "6",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540382",
      "name": "Floor Stapler | Air Actuated 1/2\"",
      "category": "Fastening Tools",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">An alternative to the hardwood nailer for specific hardwood applications. Takes 2″ staples.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Floor-Stapler-half-inch.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540376",
      "name": "Stud Driver | Single Shot",
      "category": "Fastening Tools",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Single powder shot activated nail gun used for attaching metal or wood to concrete or metal beams.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Stud-Driver.jpg"
      ],
      "price": "21",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540371",
      "name": "Carpet Stapler | Electric",
      "category": "Fastening Tools",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Carpet-Stapler.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540364",
      "name": "Quick Drive | Screwgun",
      "category": "Fastening Tools",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">The quickest and easiest way to screw subfloor, decking or even drywall. Saves your back, knees and a whole bunch of time.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Screwgun.jpg"
      ],
      "price": "24",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540358",
      "name": "Floor Nailer | Manual",
      "category": "Fastening Tools",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Floor-Nailer-Manual.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540352",
      "name": "Floor Nailer | Air Actuated 2\"",
      "category": "Fastening Tools",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Set up for 3/4″ hardwood flooring.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Powernail-445.jpg"
      ],
      "price": "18",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540346",
      "name": "Brad Nailer | Cordless 18 Gauge",
      "category": "Fastening Tools",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Most common use is trim, baseboard, and light duty projects. Battery powered so no compressor or cord required. Comes with charger and 2 batteries\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/18-Gauge-Nailer.jpg"
      ],
      "price": "18",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540340",
      "name": "Brad Nailer | 16 Gauge",
      "category": "Fastening Tools",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Heavy duty brad nailer for longer brads and larger products. Various brad lengths available.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/16-gauge-nailer.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540334",
      "name": "Air Stapler | 18 Gauge",
      "category": "Fastening Tools",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Perfect for fencing and small construction projects.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Air-Stapler-18-Gauge.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540319",
      "name": "Air Roof | Nailer",
      "category": "Fastening Tools",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Air actuated roofing nailer for coiled nails typically used for shingle roofing applications.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/HITNV45AB-hires.jpg"
      ],
      "price": "21",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540308",
      "name": "Shingle Hoist | 27' Max",
      "category": "Lift-Scaffold-Fence, Lifts",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Shingle hoist to get the bundles onto your roof, along with sheeting and other supplies. Gas driven and total 27′ long with all extensions installed.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/EH250.jpg"
      ],
      "price": "57",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540303",
      "name": "Ladder Aluminum | Step 14'",
      "category": "Ladders, Lift-Scaffold-Fence",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">14′ aluminum commercial step ladder. Sturdy for inside use. This ladder is 16&#8242; long when folded so you require at least that height to stand up. Measure twice and save the disappointment.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Step-Ladder.png"
      ],
      "price": "40",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540297",
      "name": "All Position | Ladder",
      "category": "Ladders, Lift-Scaffold-Fence",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Perfect latter for painting in your house. Can be used as a straight ladder and reach 21′ or as a step ladder to reach 8’6″ and offset step ladder to work on those nasty parts above your stairs.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/21-Foot-All-Purpose.jpg"
      ],
      "price": "18",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540291",
      "name": "Ladder 40' | Extension",
      "category": "Ladders, Lift-Scaffold-Fence",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Commercial quality 40′ extension ladder with fiberglass construction.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/40-foot-extension.jpg"
      ],
      "price": "26",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540285",
      "name": "Ladder 32' | Extension",
      "category": "Ladders, Lift-Scaffold-Fence",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/32-Foot-Extension.jpg"
      ],
      "price": "23",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540274",
      "name": "Concrete Vibrator 7/8\" Head | Foam Block",
      "category": "Concrete Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Although designed specifically for foam-block foundations, this unit can also be used on fence posts and other formed concrete.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Concrete-Vibrator.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540267",
      "name": "Scarifier Cutter",
      "category": "Concrete Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">For use with the 8″ Scarifier",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Scarifier.jpg"
      ],
      "price": "158",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540261",
      "name": "Pressure Washer | Pipe Cleaning Att. 100'",
      "category": "Automotive Equipment",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Pressure-Washer-Attachment-2.jpg",
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Pressure-Washer-Attachment.jpg"
      ],
      "price": "19",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540255",
      "name": "Engine Hoist",
      "category": "Automotive Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">A versatile crane style engine hoist with a 1500lb capacity. Breaks down for easy transfer to site.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Engine-Hoist.jpg"
      ],
      "price": "30",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540241",
      "name": "Jumping Jack | 13\" Pad",
      "category": "Compaction Equipment",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Jumping-Jack-1.jpg"
      ],
      "price": "45",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540234",
      "name": "Compactor | Dirt Tamper",
      "category": "Compaction Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Hand powered tamper for small, correction, very small jobs.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Hand-Tamper.jpg"
      ],
      "price": "10",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540228",
      "name": "Compactor 750Lbs | Gas and Diesel",
      "category": "Compaction Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">For those bigger areas and heavier lifts, this is the unit for you.  Will compact 12-18″ per lift depending on the aggregate. Plate size is 17×33″ and we have both gas and diesel powered with basically the same performance.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/DPU5545.jpg"
      ],
      "price": "90",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540222",
      "name": "Compactor 600Lbs | Reversing",
      "category": "Compaction Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Perfect for driveways and garages where larger equipment will be used. Gas powered with a reliable Honda motor, capable of packing 12-15″ per lift. Plate is 23 X 34",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Avp-3520.jpg"
      ],
      "price": "67",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540215",
      "name": "Compactor 300Lbs | Reversing",
      "category": "Compaction Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">A great compactor for creating a solid base for larger projects such as patios and walkways. This unit has forward and reverse compatibility for easy control while packing aggregate.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Bomag-25_40.jpg",
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Wacker-DPU2540.png"
      ],
      "price": "54",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540208",
      "name": "Compactor 220Lbs | Reversing",
      "category": "Compaction Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">A great compactor for creating a solid base for larger projects such as patios and walkways. This unit has forward and reverse compatibility for easy control while packing aggregate. Base plate 16″ by 24 to get into those tighter spots.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/APR-2220.jpg"
      ],
      "price": "51",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540201",
      "name": "Compactor 15\" Wide | 145Lbs",
      "category": "Compaction Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Our most commonly rented compactor for stone dust, GA and the like. Use it for creating walkways, back yard patios or base pads for sheds. Single direction, Honda powered and easy to load and handle. Will pack up to 6″ per lift  depending on aggregate.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/VP1135-1.jpg"
      ],
      "price": "40",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540187",
      "name": "Compactor 13\" Wide | 120Lbs",
      "category": "Compaction Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Smallest gas compactor for trenches, small walkways or small pads. Light and easy to handle but effective on those smaller spaces. Powered by a reliable<br />\nHonda motor and capable of taking on 4″ per lift.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/VP1030-1.jpg"
      ],
      "price": "35",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540180",
      "name": "Extension For | Core Bits 12\"",
      "category": "Drills &amp; Breakers",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">For wet coring bits, 1 1/4″ shank and 12″ long.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Core-Extension.jpg"
      ],
      "price": "10",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540175",
      "name": "Hammer Drill | 1/2\" Chuck",
      "category": "Drills &amp; Breakers",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Mainly for small concrete bits, this unit has a depth gauge and second handle for stability. Regular heavy duty drill also available.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Hammer-Drill-1_2_-Chuck.jpg"
      ],
      "price": "18",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540169",
      "name": "Drill Heavy Duty | 1/2\" Chuck",
      "category": "Drills &amp; Breakers",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Heavy duty drill when the batteries run out on your rechargeable. Reverse and multi speed trigger, as well as keyed chuck are standard. Hammer drill also available.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Drill-Heavy-Duty-1_2_-Chuck.jpg"
      ],
      "price": "12",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540145",
      "name": "Core Drill | Electric",
      "category": "Drills &amp; Breakers",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Wet coring system that requires a hose or water pressure tank. Adapter included for bits smaller than 2″.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Core-Drill-Electric.jpg"
      ],
      "price": "45",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540138",
      "name": "Breaker/Drill | 1/2\" - 1 1/2\" Bit",
      "category": "Drills &amp; Breakers",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Making a small hole or a big one, this unit is light enough to hold until the cows come home, but packs a punch too! Comes with a point and 1″ chisels, but can also be used with concrete drill bits or larger flat chisels for removing ceramic tiles.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Breaker_Drill-28Lbs.jpg"
      ],
      "price": "42",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540129",
      "name": "Breaker | Chipper 70Lbs",
      "category": "Drills &amp; Breakers",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Largest electric breaker available. Unit comes with a point and chisel combo.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/BreakerChipper-1.jpeg"
      ],
      "price": "54",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540121",
      "name": "Breaker | Chipper 35Lbs",
      "category": "Drills &amp; Breakers",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Mid-sized breaker for larger holes or harder material. Unit comes with a point and chisel combo. Other chisel variations available upon request.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Breaker_Chipper-1.jpg"
      ],
      "price": "42",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540114",
      "name": "Angle Drill | 1/2\" Chuck",
      "category": "Drills &amp; Breakers",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Perfect for hard to reach spots, and awkward situations. Not a hammer drill.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Milwaukee-Angle-Drill.jpeg"
      ],
      "price": "17",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540096",
      "name": "Skidsteer Track | Compact 48\" Wide",
      "category": "Earth Moving Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">The RT-25 Posi-Track® compact track loader is designed and created to feature the productivity and comfort that landscapers, homeowners and contractors need. Designed small, the RT-25 offers patented Posi-Track technology with the suspension, traction, and flotation you count on to shape the earth.\n<h4 style=\"text-align: center;\">Quick Specs</h4>\n<p style=\"text-align: center;\">25 HP Diesel Engine\n<p style=\"text-align: center;\">Overall Width – 48″\n<p style=\"text-align: center;\">Overall Height – 73″\n<p style=\"text-align: center;\">Lift Capacity – 665lbs\n<p style=\"text-align: center;\">Dump Height – 8’4″\n<p style=\"text-align: center;\">Operating Weight – 3800lbs\n<p style=\"text-align: center;\">Enclosed Cab\n<p style=\"text-align: center;\">Simple Joystick Control\n<p style=\"text-align: center;\">Standard 48″ Wide Bucket\n<h4 style=\"text-align: center;\">Hours Included In Rate</h4>\n<p style=\"text-align: center;\">Daily Rate – 10 Hours Max\n<p style=\"text-align: center;\">Weekend Rate – 15 Hours Max\n<p style=\"text-align: center;\">Weekly Rate – 40 Hours Max\n<p style=\"text-align: center;\">Monthly Rate – 120 Hours Max\n<p style=\"text-align: center;\">Any hours over and above will be charged at $35.00 per hour.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Track-Compact-Skidsteer.jpg"
      ],
      "price": "300",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540091",
      "name": "Telehandler | JCB 13'",
      "category": "Earth Moving Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">The JCB Telehandler is small but mighty.  It is available with pallet forks as well as a material bucket making it the ideal machine for landscape projects.  With its 4400lb lift capacity it can easily move heavy pallets or armour stone around your yard.  Clip on the bucket and now you can move your aggregates around as well.  This machine also has a telescopic boom which provides extra reach.  This simple to operate 4 wheel drive and 4 wheel steer machine is versatile on any jobsite.\n<h4 style=\"text-align: center;\">Quick Specs</h4>\n<p style=\"text-align: center;\">39 HP Diesel Engine\n<p style=\"text-align: center;\">Overall Width – 60″\n<p style=\"text-align: center;\">Overall Height – 80″\n<p style=\"text-align: center;\">Max. Lifting Height – 13’3″\n<p style=\"text-align: center;\">Max. Lifting Capacity – 4400lbs\n<p style=\"text-align: center;\">Max. Reach at Full Extension – 2’11”\n<p style=\"text-align: center;\">Max. Lifting Capacity at Full Reach – 1800lbs\n<p style=\"text-align: center;\">Operating Weight – 10000lbs\n<p style=\"text-align: center;\">Climate Controlled Enclosed Cab\n<p style=\"text-align: center;\">Available with Pallet Forks and 60″ Material Bucket\n<h4 style=\"text-align: center;\">Hours Included In Rate</h4>\n<p style=\"text-align: center;\">Daily Rate – 10 Hours Max\n<p style=\"text-align: center;\">Weekend Rate – 15 Hours Max\n<p style=\"text-align: center;\">Weekly Rate – 40 Hours Max\n<p style=\"text-align: center;\">Monthly Rate – 120 Hours Max\n<p style=\"text-align: center;\">Any hours over and above will be charged at $35.00 per hour.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/JCB-504-1.jpg"
      ],
      "price": "375",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540085",
      "name": "Sewer Snake | 35' Auto",
      "category": "Drain Cleaners",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Small drain electric snake with a 35′ cable 5/16″ diameter to get though those tough blocks.  Variable speed and auto-feed.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Model-CT-Auto-Feed.jpg"
      ],
      "price": "27",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540079",
      "name": "Sewer Snake | Manual 50'",
      "category": "Drain Cleaners",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">50′ manual drain cleaner for use in 3″ and up drains.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Manual-snake-50.jpg"
      ],
      "price": "24",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540073",
      "name": "Sewer Snake | Manual 25'",
      "category": "Drain Cleaners",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Hand turn drain snake for small drains. 25′ snake with manual lock.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Hand-snake.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540067",
      "name": "Sewer Snake | 50' Electric",
      "category": "Drain Cleaners",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">50′ electric drain snake for 3-6″ drain lines, various heads for chase through the pipe and clean out the blocks. Manual feed and electric turn.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Electric-Snake-50.jpg"
      ],
      "price": "42",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540061",
      "name": "Sewer Snake | Electric 25'",
      "category": "Drain Cleaners",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Small drain cleaner, electric powered. See video for more details.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Electric-Snake-25.jpg"
      ],
      "price": "27",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540054",
      "name": "Sewer Snake | 100' Electric",
      "category": "Drain Cleaners",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">100′ electric sewer cleaner for 4+ ” drains.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Snake-100.jpg"
      ],
      "price": "57",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540048",
      "name": "Sewer Snake | 50' Auto Feed",
      "category": "Drain Cleaners",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">50′ drain snake with auto feed. Designed to manage large drains.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Snake-50.jpg"
      ],
      "price": "48",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540042",
      "name": "Pipe Thaw | Unit",
      "category": "Drain Cleaners",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Hot water pulse style pipe thaw unit built specifically for frozen pipes. 250′ of clean water hose and 100ft of sewer hose to select based on project.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Magikist-De-icer.jpg"
      ],
      "price": "90",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540036",
      "name": "7\" Handheld | Concrete Grinder",
      "category": "Concrete Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Large grinder with a diamond grinding wheel for leveling, smoothing or removing concrete surfaces.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/concrete-grinder-e1646757697248.jpg"
      ],
      "price": "45",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540030",
      "name": "Wheelbarrow",
      "category": "Concrete Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Great for moving dirt, leaves, stones, and many more materials around the yard or job site.  Unit is equipped with foam filled no-flat tire for added durability.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Wheelbarrow.jpg"
      ],
      "price": "12",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540024",
      "name": "Propane Torch | 400,000BTU",
      "category": "Concrete Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Commercial style propane torch, 500,000 BTU. Hook up to your 20 lbs propane tank or rent one from us. Uses include melting ice, softening certain glue products, and burning weeds in concrete or paver walkways.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Propane-Torch.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540018",
      "name": "Strip-Sert Accessory | Dual Head Grinder",
      "category": "Concrete Equipment",
      "description": "",
      "short_description": "Strip-Serts are  carbide tipped blocks designed to clean surfaces without grinding into the concrete.  Strip-Serts  have 4 tungsten carbide edges that can be rotated for maximum use.  They are ideal to strip away thicker, soft material It is ideal for removing mastics, paints, resins, tar, and other build-ups.\n<p style=\"text-align: center;\">For info on application and unit it fits visit:  <a href=\"https://www.edcoinc.com/products/view/wedgeless-dual-disc-floor-grinder/\">https://www.edcoinc.com/products/view/wedgeless-dual-disc-floor-grinder/</a>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Strip-Sert.jpg"
      ],
      "price": "82",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540012",
      "name": "Concrete Scarifier | Gas Powered",
      "category": "Concrete Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Best for bringing down larger gaps in elevation on side walks or smaller shelves of concrete. Cutter head priced separately.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Scarifier-.jpg"
      ],
      "price": "150",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "540002",
      "name": "Floor | Grinder",
      "category": "Concrete Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">For medium sized grinding jobs that require smoothing or polishing of concrete. <a title=\"VACUUM-FINE DUST-12 GALLON\" href=\"https://rentalvillage.ca/product/vacuum-fine-dust-12-gallon/\">Fine dust vacuum</a> recommended. Runs on 15 Amp circuit. <strong>Unit requires purchase of the diamond blocks or discs in addition to rental. Prices vary depending on your job starting at $240 for diamond blocks for grinding concrete.</strong>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Floor-Grinder.jpg"
      ],
      "price": "45",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539996",
      "name": "Diamond Cutter Heads | Dual Head Grinder",
      "category": "Concrete Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Light grinding or cleaning of concrete surfaces, leveling uneven joints and prepping for other coatings are the most common uses. For more information please visit: <a href=\"https://www.edcoinc.com/products/view/wedgeless-dual-disc-floor-grinder/\">https://www.edcoinc.com/products/view/wedgeless-dual-disc-floor-grinder/</a>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Cutter-Heads.jpg"
      ],
      "price": "82",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539990",
      "name": "Concrete Trowel | 36 Inch",
      "category": "Concrete Equipment",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Concrete-Trowel.jpg"
      ],
      "price": "100",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539983",
      "name": "Concrete Floor Grinder | Dual Head",
      "category": "Concrete Equipment, Floor Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">The Edco Dual Head Grinder is designed to level, smooth or clean concrete slab surfaces.  With it’s 22″ working width it will grind approximately 400-500 sq. ft. per hour removing 1/32″ each pass.  With a choice of accessories the unit can be adapted to suit your application.  From light grinding or cleaning of concrete surfaces, leveling uneven joints, removing mastics, thin-set, high spots, epoxies and urethanes.  The Edco grinder is designed for dustless use &amp; has provisions to hook-up to a <a href=\"https://rentalvillage.ca/product/vacuum-fine-dust-12-gallon/\">fine dust vacuum</a>.   <em><strong>PRICE LISTED IS FOR MACHINE ONLY</strong></em>, cutter heads are rented separately.  We offer the Dyma-Sert &amp; Strip-Sert Accessories.  Watch the Video to get a better understanding what the machine can do for you.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Edco-Floor-Grinder.jpg"
      ],
      "price": "63",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539977",
      "name": "Cement Mixer | Electric",
      "category": "Concrete Equipment",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Kushlan-Cement-Mixer.jpg"
      ],
      "price": "36",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539970",
      "name": "Cement Float | 42",
      "category": "Concrete Equipment",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Cement-Float.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539941",
      "name": "Skidsteer | Sweeper 72\"",
      "category": "Earth Moving Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-tabs wc-tabs-wrapper\">\n<div id=\"tab-description\" class=\"woocommerce-Tabs-panel woocommerce-Tabs-panel--description panel entry-content wc-tab\" role=\"tabpanel\" aria-labelledby=\"tab-title-description\">\n<p style=\"text-align: center;\">Standard skid steer mount pick-up broom with hydraulically driven broom and built in bucket to catch sweepings. Unit uses three hydraulic hoses so if you plan on using your own skid steer ensure you have the correct fittings available. Care needs to be taken when sweeping around obstacles as damage waiver will not cover damage caused by striking something<br />\nand bending it. Best to consider a hand held power broom to do around the edges which we can rent you as well. This unit is available only at our Carleton<br />\nPlace location so reach out to us to book. I you need to rent a skidsteer as well the SV65 Kubota will be the best unit for it.\n</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Skidsteer-Sweeper.jpg"
      ],
      "price": "250",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539931",
      "name": "Excavator 4 Ton | Kubota KX040",
      "category": "Earth Moving Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center; color: #a6093d;\"><strong>*** Unit is available for customer pick-up but only at our Carleton Place Location</strong><strong>***</strong>\n<p style=\"text-align: center;\">Our largest excavator on rubber tracks that still offers compact design and maneuverability. The KX040 is a great machine for larger excavation jobs.\n<h4 style=\"text-align: center;\">Quick Specs</h4>\n<p style=\"text-align: center;\">40 HP Diesel Engine\n<p style=\"text-align: center;\">Overall Width – 68″\n<p style=\"text-align: center;\">Overall Height – 98″\n<p style=\"text-align: center;\">Digging Depth – 11’2″\n<p style=\"text-align: center;\">Dump Height – 12’8″\n<p style=\"text-align: center;\">Operating Weight – 9400lbs\n<p style=\"text-align: center;\">Climate Controlled Enclosed Cab\n<p style=\"text-align: center;\">Hydraulic Thumb\n<p style=\"text-align: center;\">24″ Toothed Bucket &amp; 36″ Smooth Ditching Bucket\n<h4 style=\"text-align: center;\">Hours Included In Rate</h4>\n<p style=\"text-align: center;\">Daily Rate – 10 Hours Max\n<p style=\"text-align: center;\">Weekend Rate – 15 Hours Max\n<p style=\"text-align: center;\">Weekly Rate – 40 Hours Max\n<p style=\"text-align: center;\">Monthly Rate – 120 Hours Max\n<p style=\"text-align: center;\">Any hours over and above will be charged at $40.00 per hour.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Kubota-Kx040-1.jpg"
      ],
      "price": "400",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539925",
      "name": "Excavator 2.5 Ton | Kubota U25",
      "category": "Earth Moving Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">This is our Mid-Size Excavator on rubber tracks that still offers compact design and maneuverability.  Ideal for most landscape jobs where maneuverability is required.\n<h4 style=\"text-align: center;\">Quick Specs</h4>\n<p style=\"text-align: center;\">20 HP Diesel Engine\n<p style=\"text-align: center;\">Overall Width – 60″\n<p style=\"text-align: center;\">Overall Height – 95″\n<p style=\"text-align: center;\">Digging Depth – 9’5″\n<p style=\"text-align: center;\">Dump Height – 10’\n<p style=\"text-align: center;\">Operating Weight – 5700lbsOpen Cab\n<p style=\"text-align: center;\">Hydraulic Thumb16″ Toothed Bucket &amp; 30″ Smooth Ditching Bucket\n<h4 style=\"text-align: center;\">Hours Included In Rate</h4>\n<p style=\"text-align: center;\">Daily Rate – 10 Hours Max\n<p style=\"text-align: center;\">Weekend Rate – 15 Hours Max\n<p style=\"text-align: center;\">Weekly Rate – 40 Hours Max\n<p style=\"text-align: center;\">Monthly Rate – 120 Hours Max\n<p style=\"text-align: center;\">Any hours over and above will be charged at $30.00 per hour.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Kubota-U25-1.jpg"
      ],
      "price": "300",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539907",
      "name": "Backhoe Loader | Kubota B23",
      "category": "Earth Moving Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Kubota pioneered the sub-compact 4-wheel drive diesel tractor, making it efficiently preform a variety of gardening, landscaping, and general property maintenance tasks. A fuel-efficient 3-cylinder diesel engine provides plenty of power to haul, climb, and pull your way through even the most challenging tasks.<br />\nUnit is rented on a trailer which you can tow behind your vehicle with 2″ ball and 5000 lbs towing capacity.\n<p style=\"text-align: center;\">These units weigh in at 3000 lbs roughly and includes a trailer. Your towing capacity needs to be over 5000 pounds with a 2” ball.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Kubota-B23-1.jpg"
      ],
      "price": "340",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539897",
      "name": "Pressure Washer | Gas 3200PSI",
      "category": "Automotive Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Only for the toughest jobs, this unit has more than enough power to remove paint, dirt and any unwanted foreign material.<br />\nThis unit has an adjustable PSI range and comes with nozzles and 50′ of pressure hose.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Stihl-RB-600.jpg"
      ],
      "price": "60",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539890",
      "name": "Pressure Washer | Ext. Wand 18'",
      "category": "Automotive Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Great for the hard to reach areas including windows, gutters and roofs.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Telescopic-Wand.jpg"
      ],
      "price": "14",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539882",
      "name": "Pressure Washer | Gas 2500PSI",
      "category": "Automotive Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Gas powered pressure washers are the perfect choice to clean or resurface many things when a smaller electric unit just isn’t enough. They are the<br />\nideal choice for cleaning decks, driveways and many other chores around the property.  Comes with nozzles and 25′ of pressure hose.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Stihl-RB-200.jpg"
      ],
      "price": "48",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539875",
      "name": "Pressure Washer | Electric 1000PSI",
      "category": "Automotive Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Light duty electric unit for standard home use. Comes with nozzles and 50′ of pressure hose.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/1000PSI-Power-Washer-Electric.jpg"
      ],
      "price": "27",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539868",
      "name": "Hydraulic Jack | 20 Ton",
      "category": "Automotive Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Small condensed unit for leveling a cottage or jacking up a deck. Twenty tonne capacity, 9 1/2″-17 3/4″ height.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Hydraulic-Jack.jpg"
      ],
      "price": "16",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539861",
      "name": "Travel Jack 48\" | 1500LB Capacity",
      "category": "Automotive Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">A light duty jack to lift lighter projects to a higher level. 6″-48″ travel",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/48-inch-Jack.jpg"
      ],
      "price": "16",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539854",
      "name": "Grinder | 7 Inch",
      "category": "Automotive Equipment",
      "description": "",
      "short_description": "<div class=\"woocommerce-product-details__short-description\">\n<p style=\"text-align: center;\">Large grinder with multiple uses including grinding and cutting. See concrete grinder for diamond grinding tool.\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Hitachi-7-inch.jpg"
      ],
      "price": "24",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539844",
      "name": "Grinder | 4 1/2",
      "category": "Automotive Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Great unit for smaller grinding and cutting jobs. Standard 7/8″ arbor.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Hitachi-G12SE2.jpg"
      ],
      "price": "15",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539829",
      "name": "Whip Check | For Air Hose",
      "category": "Air Compressors &amp; Tools",
      "description": "",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Whip-Check.jpg"
      ],
      "price": "5",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539804",
      "name": "Air Drill | 38Lbs",
      "category": "Air Compressors &amp; Tools",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">For use with the 185 or 70 CFM air compressors, drills 1 1/2″ to 2 1/2″ holes. Two or four foot drill steels available. Carbide tipped drill bits used to drill for anchors, fencing posts or rock breaking jobs.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/MRD55.jpg"
      ],
      "price": "50",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539797",
      "name": "Air Compressor | 5.5HP 12.5CFM",
      "category": "Air Compressors &amp; Tools",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">When you have no electricity or need that extra power, this compressor won’t disappoint. Three ports available for different lines to different tools and is also great for blowing out smaller residential lines for winterizing the cottage.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Air-Compressor-5.5HP.jpg"
      ],
      "price": "48",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539790",
      "name": "Air Compressor | Electric 2HP",
      "category": "Air Compressors &amp; Tools",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Smaller compressor for indoor or outdoor jobs with smaller demands.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Air-Compressor-2HP.jpg"
      ],
      "price": "24",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539783",
      "name": "Air Compressor | 70CFM Portable",
      "category": "Air Compressors &amp; Tools",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Large enough to handle a 60lb breaker but small enough to fit in the back of an SUV. One man moveable, 70 CFM output at 100psi, with a Chicago air hose fitting. Removable gas tank holds 20L. Electric start.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Conx-SC70.jpg"
      ],
      "price": "63",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539777",
      "name": "Air Compressor | 185CFM Towable",
      "category": "Air Compressors &amp; Tools",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Large diesel tow behind unit only requires a 2&#8243; ball for towing. Total output of 185CFM at 100 psi is great for air breakers, air drills, blowing out water lines, and large capacity sand blasters.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Kaesar-M50-1.jpg"
      ],
      "price": "110",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539771",
      "name": "Air Breaker | 60Lbs",
      "category": "Air Compressors &amp; Tools",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">This air powered 60lb breaker can handle many problems. If you have to break off an old concrete step, or clean out holes for a fence or a deck, this unit will do the job.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Air-Breaker.jpg"
      ],
      "price": "50",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539739",
      "name": "Walk Behind | 18\" Trencher",
      "category": "Earth Moving Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Walk-behind trencher digs a 4″ wide by 18″ deep trench for easy laying of pipe or wiring. Trailer with 2″ ball available with unit.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/barreto-712.jpg"
      ],
      "price": "99",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539733",
      "name": "Stump Grinder 13HP | Dosko 337S-13HC",
      "category": "Lawn &amp; Garden, Stump Grinder",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Sick of cutting around those pesky stumps, rent this tool to ease your pain. Just dig around the stump to make sure there is no rocks and grind the stump below grade and cover over.<br />\n10-12 ” stump should take you less than 30 minutes if you have it cut down to 2 ” above the ground with your chainsaw.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Dosko-337.jpg"
      ],
      "price": "84",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539725",
      "name": "Turf Revitalizer | Classen HTS-20H PRO Hydro-Drive",
      "category": "Lawn Care",
      "description": "<a href=\"https://www.classenturfcare.com/product/turf-overseeder-hydro-drive-pro/\">https://www.classenturfcare.com/product/turf-overseeder-hydro-drive-pro/</a>",
      "short_description": "<p style=\"text-align: center;\">Touch up your dead spots on your lawn with some fresh seed and turn them green.\n<p style=\"text-align: center;\"><span style=\"font-family: var(--global-body-font-family);\">The Classen HTS-20H is designed to make seeding easier and more efficient. This self-propelled machine feature hydrostatic drive and a floating seed box that ensures precise seed placement, resulting in thicker and healthier turf. With features like a Honda engine, 13 double-bladed shafts, and a narrow 1.5-inch seed row spacing, the overseeders provide carpet-like coverage even on uneven terrain. Whether for commercial or residential use, this overseeders offer the power and convenience needed to quickly achieve lush, healthy grass. For those seeking a reliable and effective solution for lawn overseeding, the Classen turf overseeders are a top choice.</span>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Classen-Overseeder-1.jpg"
      ],
      "price": "60",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": [
        "LAWN",
        "SEEDER"
      ]
    },
    {
      "id": "539713",
      "name": "Lawn Aerator | Ryan Lawnaire IV Aerator",
      "category": "Lawn Care",
      "description": "",
      "short_description": "<div>\n<div style=\"text-align: center;\">The Lawnaire IV aerators has Easy Steer Technology and is designed for lawn care operators and rental houses looking for top-quality lawn care equipment. this drum-style, self-propelled aerators combines performance, durability, and ease of use, making it ideal for both small and large lawn care contractors. The Easy Steer Technology allows for efficient maneuvering around highly landscaped areas, while the innovative tine assemblies enable steering without removing the tines from the ground. With aeration widths of 19 inches, the Lawnaire IV was named the &#8220;best walk-behind aerator&#8221; by Bob Vila in 2022. Check out the benefits <a href=\"https://www.youtube.com/watch?v=DtAMsuDKrOc\">here</a>.</div>\n</div>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/jj1705_1-1.jpg"
      ],
      "price": "57",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539707",
      "name": "Skidsteer Track | Kubota SVL65",
      "category": "Earth Moving Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center; color: #a6093d;\"><strong>*** Unit is available for customer pick-up but only at our Carleton Place Location</strong><strong>***</strong>\n<p style=\"text-align: center;\">Kubota SV65 Track Skid Steer is 68” wide. Heavy enough for those larger landscaping and back filling projects. Tracks allow it to go over fresh sand and fill without sinking. Full Cab with heating and air conditioning.\n<p style=\"text-align: center;\">These units weigh in at 6500 lbs roughly and require a tandem axle float if you are planning on picking up yourself. We also rent tilt deck float if you don’t have a trailer but have a truck with 10000 pounds towing capacity or more.\n<p style=\"text-align: center;\"><strong>PLEASE NOTE: The rental of this unit does not include a trailer and there is a $200 cleaning charge if returned dirty.</strong>",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Kubota-SVL65.jpg"
      ],
      "price": "350",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539701",
      "name": "Excavator 1.8 Ton | Kubota U17",
      "category": "Earth Moving Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">This unit is the Kubota KX-018 with the strength and durability the brand is know for. It features the dual track position offering stability when at its wide mode of 52″ and compact width of 39″ with the tracks retracted.<br />\nThese machines weighs in at 3900 lbs and you are able to pick up yourself if you have a trailer capable of handling or have us deliver. Rental rate does not include a trailer.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Kubota-U17.jpg"
      ],
      "price": "250",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539696",
      "name": "Skidsteer Wheeled | Kubota SSV65",
      "category": "Earth Moving Equipment",
      "description": "",
      "short_description": "<p style=\"text-align: center; color: #a6093d;\"><strong>*** Unit is available for customer pick-up but only at our Carleton Place Location</strong><strong>***</strong>\n<p style=\"text-align: center;\">Stack it, haul it, dig it and move it better with a Kubota skid steer loader. The SSV65 is a  powerful and dependable machine that is easy to operate and provides exceptional operator comfort. Hop into the roomy climate controlled cab<br />\nand tackle whatever job you have in front of you!  Delivery service available or rent a trailer and to take it home yourself.  Tow vehicle must have a minimum 10000lb tow capacity.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Kubota-SSV65.jpg"
      ],
      "price": "275",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539690",
      "name": "Backhoe Loader | Kubota B26",
      "category": "Earth Moving Equipment",
      "description": "<p style=\"text-align: left;\">We have chosen the Kubota B26 tractor backhoe for its reliability, ease of operation and its very capable attributes for the size.\n<p style=\"text-align: left;\">The loader bucket is 62″ wide and holds roughly 1/3 yd of material and the backhoe bucket is 16″ wide with digging teeth and a hydraulic thumb.\n<p style=\"text-align: left;\">These units weigh in at 5600 lbs roughly and require a tandem axle float if you are planning on picking up yourself. We also rent tilt deck <a href=\"https://rentalvillage.ca/product/dump-trailer-dual-axle-float/\">float</a> if you don’t have a trailer but have a truck with 6500 pounds towing capacity or more.\n<p style=\"text-align: left;\"><strong>PLEASE NOTE: The rental of this tractor does not include a trailer.</strong>",
      "short_description": "",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Kubota-B26.jpg"
      ],
      "price": "280",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539682",
      "name": "Baker Scaffold",
      "category": "Lift-Scaffold-Fence, Scaffold",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Small, lightweight, aluminum scaffold great for drywall, painting, and working on stairs. Each set is 24″ wide and 6′ high and can be stacked two high. (Rents as a complete set-two ends, one platform and 4 wheels)",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Scaffold-1.jpg"
      ],
      "price": "18",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539673",
      "name": "19' Scissor | Lift",
      "category": "Lift-Scaffold-Fence, Lifts",
      "description": "",
      "short_description": "<p style=\"text-align: center;\">Compact<strong> indoor</strong> scissor lift which lifts your feet to 19′. Unit is 32″ wide and 6′ long with a telescopic work platform. These machines have very little clearance so will only load on a roll off truck or tilt deck trailer. Work site needs to be perfectly flat and hard or these lifts won&#8217;t work so on a slab is best plan. Check with us regarding delivery services.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Optimum-1931-E.jpg"
      ],
      "price": "150",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539639",
      "name": "Towable Man | Lift 50'",
      "category": "Lift-Scaffold-Fence, Lifts",
      "description": "<div class=\"w-full text-token-text-primary\" data-testid=\"conversation-turn-5\">\n<div class=\"px-4 py-2 justify-center text-base md:gap-6 m-auto\">\n<div class=\"flex flex-1 text-base mx-auto gap-3 md:px-5 lg:px-1 xl:px-5 md:max-w-3xl lg:max-w-[40rem] xl:max-w-[48rem] group final-completion\">\n<div class=\"relative flex w-full flex-col agent-turn\">\n<div class=\"flex-col gap-1 md:gap-3\">\n<div class=\"flex flex-grow flex-col max-w-full\">\n<div class=\"min-h-[20px] text-message flex flex-col items-start gap-3 whitespace-pre-wrap break-words [.text-message+&amp;]:mt-5 overflow-x-auto\" data-message-author-role=\"assistant\" data-message-id=\"b8f74f22-1d5e-41ed-9369-dbdefc8aa8e1\">\n<div class=\"markdown prose w-full break-words dark:prose-invert light\">\nThe Nifty Lift TM50 Towable Lift offers unparalleled flexibility and convenience for accessing elevated work areas. Its towable design allows for easy transportation to different job sites, making it an ideal choice for contractors and homeowners. Tows behind a vehicle that can handle 6000 lbs and uses a 2\" ball. With a maximum working height of 50 feet and an outreach of 30 feet, this lift provides ample reach for a wide range of tasks, from maintenance to construction projects. Equipped with a telescopic boom and articulated jib, operators can navigate around obstacles with precision and efficiency. The lift's lightweight construction and hydraulic outriggers ensure stability and safety during operation. Furthermore, its intuitive controls and quick setup time maximize productivity on the job site. Overall, the Nifty Lift TM50 Towable Lift offers versatility, convenience, and performance, making it an essential tool for professionals in various industries. See the links below to access specs and video. Pay close attention the the width of the unit with stabilizers down to ensure you have enough space on your site. Our unit doesn't have the drive assist on wheels.\nSpecs:\n<a href=\"https://www.niftylift.com/application/files/9216/7084/8457/TM50_IS-111.pdf\">https://www.niftylift.com/application/files/9216/7084/8457/TM50_IS-111.pdf</a>\n</div>\n</div>\n</div>\n<div class=\"mt-1 flex justify-start gap-3 empty:hidden\">\n<div class=\"text-gray-400 flex self-end lg:self-center items-center justify-center lg:justify-start mt-0 -ml-1 h-7 gap-[2px] visible\">\n<div></div>\n<div class=\"flex items-center gap-1.5 text-xs\">Introduction and set up:</div>\n</div>\n<div><a href=\"https://www.youtube.com/watch?v=I0_BLzb3Edg&amp;t=21s\">https://www.youtube.com/watch?v=I0_BLzb3Edg&amp;t=21s</a></div>\n<div class=\"text-gray-400 flex self-end lg:self-center items-center justify-center lg:justify-start mt-0 -ml-1 h-7 gap-[2px] visible\">\n<div class=\"flex\"></div>\n</div>\n</div>\n<div class=\"pr-2 lg:pr-0\"></div>\n</div>\n<div class=\"absolute\">\n<div class=\"flex w-full gap-2 items-center justify-center\"></div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<div class=\"mx-auto\">\n<div>\n<div class=\"mx-auto mt-2 inline-flex rounded-xl border border-gray-100 dark:border-gray-700\"></div>\n</div>\n</div>",
      "short_description": "<p style=\"text-align: center;\">Safe and easy way to get up to that project you are regretting. These units are towable with a full sized truck with a tow capacity of over 5000 lbs,  2″ ball and  20″ minimum hitch height which<br />\nis required to keep the front wheel from dragging while in transit. Check the specs sheet on line to make sure you can reach your job or stop by and pick one up at any of our stores.<br />\nThese units tend to be busy and can land at any of our stores so make sure you call ahead and book to ensure you have it when you need it.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Nifty-TM50-1.jpg"
      ],
      "price": "375",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    },
    {
      "id": "539637",
      "name": "Track Driven | Lift 42'",
      "category": "Lift-Scaffold-Fence, Lifts",
      "description": "&nbsp;\nThe Nifty Lift TD42 Track Drive Lift is a versatile and robust aerial work platform designed for accessing difficult-to-reach areas with ease. Its track drive system ensures excellent traction on uneven terrain, making it ideal for outdoor applications such as construction sites and landscaping projects. With a maximum working height of 42 feet and an outreach of 21 feet, this lift offers impressive reach capabilities while maintaining stability. Equipped with a 360-degree rotating platform, operators can efficiently maneuver and position themselves precisely, enhancing productivity and safety. The lift's compact dimensions allow for easy transportation and maneuverability in confined spaces. Additionally, its robust construction and reliable performance ensure durability and longevity, providing users with a cost-effective solution for their access needs. Overall, the Nifty Lift TD42 Track Drive Lift combines versatility, safety, and efficiency, making it an indispensable asset for various industries.\nPlease visit this link to see all the specifications so you can ensure you have enough space to use on your site. Pay special attention to the overall width with the stabilizers down. First link is the specs and the second is a YouTube video showing its operation and set up.\n<a href=\"https://www.niftylift.com/application/files/1716/4915/0151/TD42T_IS-106.pdf\">https://www.niftylift.com/application/files/1716/4915/0151/TD42T_IS-106.pdf</a>\n<a href=\"https://youtu.be/bjA3a0OnFyc\">https://youtu.be/bjA3a0OnFyc</a>\n&nbsp;",
      "short_description": "<p style=\"text-align: center; color: #a6093d;\"><strong>*** This unit is only available for pick-up and return from/to our Carleton Place Location***</strong>\n<p style=\"text-align: center;\">Safe and easy and maneuverable way to complete that project. This unit offer exceptional all-around performance from a compact and low weight base, and with a 225kg<br />\nsafe-working-load, plenty of capacity for tools as well. The tracks give you amazing traction even on rough terrain but are also design to be anti-marking. Unit weighs 4400 lbs so towable on a tandem axle float with appropriate sized truck.",
      "images": [
        "https://rentalvillage.ca/wp-content/uploads/2022/03/Nifty-TD42T-1.jpg"
      ],
      "price": "400",
      "sku": "",
      "use_cases": [],
      "features": [],
      "image_keywords": []
    }
  ],
  "unavailable_machines": []
}